[
  {
    "condition_name": "Low Back Pain (Mechanical)",
    "category": "Orthopedics",
    "clinical_presentation": {
      "definition": "Mechanical low back pain (LBP) refers to pain in the lumbar region that is exacerbated by movement or specific postures and relieved by rest or changes in position. It is typically not associated with radiculopathy or other neurological deficits. Common causes include muscle strains, ligamentous sprains, discogenic pain (without nerve compression), facet joint dysfunction, and myofascial pain syndrome. It is the most common type of LBP, representing approximately 90% of cases.",
      "image_description": "A diverse person in their 30s-40s gently touching their lower back with a grimace, demonstrating discomfort, possibly while attempting to bend or lift. The background suggests a home or office setting. No visible neurological deficits."
    },
    "electrotherapy": [
      {
        "type": "Transcutaneous Electrical Nerve Stimulation (TENS)",
        "parameters": "High frequency (conventional TENS): 80-120 Hz, pulse width 50-100 µs, intensity to strong but comfortable tingling without muscle contraction. Duration 30-60 minutes, 2-3 times daily as needed.",
        "placement_guide": "Electrodes placed paraspinally over the painful lumbar region, either bilaterally or surrounding the epicenter of pain. Can also be placed dermatomal or myotomal based on pain referral pattern.",
        "goal": "Acute pain relief, modulation of pain perception, reduction of muscle spasm.",
        "image_description": "Close-up of TENS electrodes placed bilaterally over the lumbar paraspinal muscles of a person lying prone, with the TENS unit visible and turned on."
      },
      {
        "type": "Interferential Current (IFC)",
        "parameters": "Carrier frequency 4000-5000 Hz, beat frequency 80-120 Hz for acute pain (sensory level) or 1-10 Hz for chronic pain (motor level), intensity to strong but comfortable sensation. Duration 15-20 minutes, 1-2 times daily.",
        "placement_guide": "Four electrodes placed in a cross pattern around the area of maximum pain in the lumbar spine, creating an interference pattern within the painful region.",
        "goal": "Pain relief, reduction of inflammation, muscle spasm reduction, improved local circulation.",
        "image_description": "Illustration showing the cross-over placement of four IFC electrodes on the lower back of an anatomical figure, indicating the interference field."
      }
    ],
    "therapeutic_exercises": {
      "phase_1": {
        "name": "Acute/Subacute Phase: Pain Management & Gentle Mobility",
        "goal": "Reduce pain, decrease muscle guarding, restore initial pain-free range of motion, introduce gentle core stabilization.",
        "exercises": [
          {
            "name": "Pelvic Tilts (Supine)",
            "instructions": "Lie on your back with knees bent, feet flat on the floor. Gently flatten your lower back into the floor by tightening your abdominal muscles and rolling your pelvis back, then arch your lower back slightly, tilting your pelvis forward. Perform slowly and rhythmically.",
            "dosage": "10-15 repetitions, 2-3 sets, daily.",
            "image_description": "A person lying supine with knees bent, demonstrating a pelvic tilt. One image shows the pelvis tilted posteriorly (flattening back), another shows anterior tilt (arching back)."
          },
          {
            "name": "Knee-to-Chest Stretch (Single & Double)",
            "instructions": "Lie on your back, bring one knee towards your chest, gently hugging it with your hands until a comfortable stretch is felt in the lower back/gluteal region. Hold. Repeat with the other leg. Progress to both knees simultaneously if pain allows.",
            "dosage": "Hold 20-30 seconds, 3 repetitions per leg (or both), 1-2 times daily.",
            "image_description": "A person lying supine, first pulling one knee to the chest, then in a separate image, pulling both knees to the chest."
          },
          {
            "name": "Transverse Abdominis (TrA) Activation (Drawing-in Maneuver)",
            "instructions": "Lie on your back with knees bent. Place your fingers on your pelvic bones, just inside. Gently draw your belly button towards your spine without moving your spine or activating larger abdominal muscles. You should feel a subtle tension under your fingers. Breathe normally.",
            "dosage": "Hold 5-10 seconds, 10-15 repetitions, 2-3 sets, daily.",
            "image_description": "A person lying supine, demonstrating the drawing-in maneuver. An arrow points to the lower abdomen indicating the inward pull."
          },
          {
            "name": "Cat-Cow Stretch (Modified)",
            "instructions": "Start on hands and knees. Gently round your back towards the ceiling like a cat, tucking your chin and tailbone. Then, gently arch your back, lifting your head and tailbone (cow pose). Move within a pain-free range, focusing on spinal articulation.",
            "dosage": "8-12 repetitions, 2-3 sets, daily.",
            "image_description": "A person on hands and knees, showing the 'cat' pose (rounded back) and 'cow' pose (arched back) in two sequential images."
          }
        ]
      },
      "phase_2": {
        "name": "Intermediate Phase: Progressive Strengthening & Functional Movement",
        "goal": "Improve core strength and stability, enhance flexibility, progress functional movement patterns, prepare for increased activity levels.",
        "exercises": [
          {
            "name": "Bird-Dog",
            "instructions": "Start on hands and knees. Keep your core engaged and spine neutral. Slowly extend one arm straight forward and the opposite leg straight back, maintaining a stable trunk. Avoid arching or rotating your back. Return to start and alternate sides.",
            "dosage": "8-12 repetitions per side, 2-3 sets, 3-4 times per week.",
            "image_description": "A person on hands and knees, extending the right arm forward and the left leg backward, maintaining a straight line from hand to foot, with a neutral spine."
          },
          {
            "name": "Gluteal Bridges",
            "instructions": "Lie on your back with knees bent, feet flat on the floor, hip-width apart. Engage your glutes and lift your hips off the floor until your body forms a straight line from shoulders to knees. Avoid over-arching your lower back. Slowly lower down.",
            "dosage": "10-15 repetitions, 2-3 sets, 3-4 times per week.",
            "image_description": "A person lying supine with knees bent, performing a gluteal bridge, with hips elevated and a straight line from shoulders to knees."
          },
          {
            "name": "Side Plank (Modified)",
            "instructions": "Lie on your side, supporting your body on your forearm and knees (or feet for advanced). Keep your body in a straight line from head to knees/feet, engaging your core and glutes. Avoid sagging hips. Hold.",
            "dosage": "Hold 20-45 seconds per side, 2-3 repetitions, 3-4 times per week.",
            "image_description": "A person demonstrating a modified side plank, resting on their forearm and knees, with the body in a straight line."
          },
          {
            "name": "Superman (Prone)",
            "instructions": "Lie face down on the floor with arms extended overhead. Gently lift your head, chest, and arms a few inches off the floor while keeping your gaze downwards. You can also lift legs simultaneously or alternate. Hold briefly and slowly lower.",
            "dosage": "8-12 repetitions, 2-3 sets, 3-4 times per week.",
            "image_description": "A person lying prone, lifting their head, chest, and arms off the floor, with arms extended forward."
          }
        ]
      },
      "phase_3": {
        "name": "Advanced Phase: Dynamic Stability & Return to Activity",
        "goal": "Enhance dynamic core stability, improve muscular endurance, increase strength for functional and recreational activities, implement injury prevention strategies.",
        "exercises": [
          {
            "name": "Plank Variations (Full Plank, Plank with Leg Lift)",
            "instructions": "Start in a full plank position (on forearms and toes). Maintain a straight line from head to heels, engaging your core and glutes. Progress by lifting one leg a few inches off the floor for a few seconds, then alternating.",
            "dosage": "Full plank hold 45-90 seconds. Leg lift 5-10 repetitions per leg, 2-3 sets, 3-4 times per week.",
            "image_description": "A person in a full forearm plank position, followed by an image of the same person lifting one leg slightly off the floor."
          },
          {
            "name": "Squats (Bodyweight/Light Resistance)",
            "instructions": "Stand with feet hip-width apart. Keeping your chest up and back straight, push your hips back and bend your knees as if sitting in a chair. Descend to a comfortable depth, ensuring knees track over toes. Return to standing. Add light dumbbells or resistance bands if appropriate.",
            "dosage": "10-15 repetitions, 2-3 sets, 3 times per week.",
            "image_description": "A person demonstrating a bodyweight squat, showing proper form with a straight back and chest up."
          },
          {
            "name": "Lunges (Forward/Reverse)",
            "instructions": "Stand tall, step one leg forward (or backward), lowering your hips until both knees are bent at approximately a 90-degree angle. Ensure your front knee is over your ankle and your back knee hovers above the floor. Push off to return to start. Alternate legs.",
            "dosage": "8-12 repetitions per leg, 2-3 sets, 3 times per week.",
            "image_description": "A person demonstrating a forward lunge, showing the proper knee and hip angles."
          },
          {
            "name": "Walking/Jogging Program",
            "instructions": "Begin with brisk walking, gradually increasing duration and intensity. If appropriate and pain-free, progress to a walk-jog interval program, slowly increasing jogging time. Focus on proper posture and comfortable pace.",
            "dosage": "20-45 minutes, 3-5 times per week, adjusting intensity and duration based on tolerance.",
            "image_description": "A person walking briskly outdoors on a paved path, with good posture and a relaxed gait. Optionally, a person jogging lightly."
          }
        ]
      }
    },
    "clinical_notes": {
      "assessment_diagnosis": "Comprehensive assessment involves a thorough history (onset, nature of pain, aggravating/alleviating factors, red flags) and physical examination. Examination includes postural analysis, lumbar range of motion, neurological screen (dermatomes, myotomes, reflexes), palpation, special tests (e.g., Slump test, straight leg raise if radicular symptoms are suspected, though less common in purely mechanical LBP), and muscle length/strength assessment. Differential diagnosis focuses on ruling out serious pathology (e.g., fracture, tumor, infection, cauda equina syndrome) before confirming mechanical LBP. Pain provocation tests (e.g., extension-rotation for facet joints, sustained flexion for discogenic) can help pinpoint specific structures, but often mechanical LBP is non-specific.",
      "manual_therapy": "Manual therapy techniques may include soft tissue mobilization (massage, myofascial release) to address muscle spasm and trigger points in the paraspinal muscles, glutes, and hips. Joint mobilization or manipulation may be used for hypomobile lumbar or sacroiliac joints, if indicated by assessment findings and clinical reasoning. Lumbar traction, either manual or mechanical, can be employed for pain relief and joint decompression, especially if there's a component of nerve root irritation (though less primary for pure mechanical LBP). Positional release or muscle energy techniques can help normalize muscle tone and joint alignment.",
      "precautions": "Always screen for red flags indicating serious spinal pathology (e.g., unexplained weight loss, fever, history of cancer, severe progressive neurological deficit, bowel/bladder dysfunction, saddle anesthesia, trauma). Avoid exercises that significantly increase pain or peripheralize symptoms. Educate patients on proper body mechanics for lifting, bending, and sitting. Emphasize gradual progression of exercises and the importance of consistency. Monitor for signs of exercise intolerance or symptom aggravation. Ensure proper form for all exercises to prevent further injury. Consider psychological factors (yellow flags) that may impede recovery and address them appropriately.",
      "scientific_reference": "Foster, N. E., Anema, J. R., Cherkin, D., Chou, R., Cohen, S. P., Gross, D. P., ... & Woolf, A. (2018). Prevention and treatment of low back pain: evidence, challenges, and promising directions. The Lancet, 391(10137), 2368-2383."
    }
  },
  {
    "condition_name": "Stroke (Hemiplegia)",
    "category": "Neurology",
    "clinical_presentation": {
      "definition": "Stroke (cerebrovascular accident) is a medical condition in which poor blood flow to the brain results in cell death. Hemiplegia refers to paralysis or severe weakness on one side of the body, often contralateral to the brain lesion, leading to significant impairments in motor control, sensation, balance, speech, and functional independence.",
      "image_description": "A patient, typically an older adult, in a rehabilitation gym performing exercises. One side of their body (e.g., right arm and leg) appears weakened or supported, perhaps using a parallel bar for gait training or sitting on an exercise ball for trunk stability. A physical therapist is guiding or assisting the patient."
    },
    "electrotherapy": [
      {
        "type": "Functional Electrical Stimulation (FES)",
        "parameters": "Pulse duration: 200-300 µs; Frequency: 20-50 Hz; Intensity: To elicit a functional contraction without pain; On/Off ratio: 1:3 to 1:5 (e.g., 5-10 sec on, 15-50 sec off); Ramp up/down: 1-2 sec.",
        "placement_guide": "Commonly applied to paretic muscles to facilitate functional movements (e.g., wrist extensors for grasp and release, tibialis anterior for dorsiflexion during gait swing, quadriceps for knee extension during stance). Electrodes placed over muscle belly and motor point.",
        "goal": "To facilitate muscle re-education, improve motor control, reduce spasticity (through reciprocal inhibition), prevent disuse atrophy, improve range of motion, and enhance functional task performance (e.g., gait, reaching).",
        "image_description": "Close-up of electrodes placed on a patient's paretic forearm (wrist extensors) or lower leg (tibialis anterior) connected to an FES device. The patient is attempting a functional movement (e.g., grasping an object or lifting foot)."
      }
    ],
    "therapeutic_exercises": {
      "phase_1": {
        "name": "Early Mobilization and Basic Motor Control",
        "goal": "Prevent secondary complications (contractures, skin breakdown), improve bed mobility, facilitate early active movement, establish trunk control, and prepare for upright positions.",
        "exercises": [
          {
            "name": "Passive/Active-Assisted Range of Motion (PROM/AAROM)",
            "instructions": "Perform full passive range of motion on all paretic joints (shoulder, elbow, wrist, hand, hip, knee, ankle, foot) 3 times daily. If the patient has any active movement, assist them through the full available range.",
            "dosage": "10-15 repetitions per joint, 2-3 sets, 3 times daily.",
            "image_description": "A physical therapist gently moving a patient's paretic arm or leg through its full range of motion while the patient is lying in bed."
          },
          {
            "name": "Bridging Exercise",
            "instructions": "Patient lies supine with knees bent, feet flat. Instruct patient to lift their hips off the bed by pushing through their feet, focusing on equal weight bearing if possible. Therapist may assist on the paretic side.",
            "dosage": "10-15 repetitions, 2-3 sets, 1-2 times daily.",
            "image_description": "A patient lying supine in bed, lifting their hips off the bed, supported by their shoulders and feet. A therapist's hands might be gently guiding the patient's hips or paretic leg."
          },
          {
            "name": "Trunk Rotation (Log Roll) to Side Lying",
            "instructions": "From supine, flex the non-paretic knee and place the foot flat. Use the non-paretic arm to reach across the body towards the paretic side. Roll the entire body as one unit towards the paretic side, maintaining head and trunk alignment. Progress to sitting balance.",
            "dosage": "5-10 repetitions per side, 2-3 sets, 1-2 times daily.",
            "image_description": "A patient in supine, initiating a log roll towards their side, with the therapist assisting or cueing trunk movement."
          },
          {
            "name": "Unsupported Sitting Balance",
            "instructions": "Patient sits upright on the edge of the bed or a stable chair with feet flat on the floor. Encourage symmetrical weight bearing. Start with static holding, then progress to reaching activities within arm's length, gradually increasing distance.",
            "dosage": "Hold for 30-60 seconds, 3-5 repetitions. Progress to dynamic reaching for 5-10 repetitions, 2-3 sets.",
            "image_description": "A patient sitting upright on a plinth or edge of a bed, unsupported, maintaining their balance. A therapist is nearby for safety, ready to guard."
          }
        ]
      },
      "phase_2": {
        "name": "Strength, Balance, and Functional Reintegration",
        "goal": "Improve voluntary motor control and strength in paretic limbs, enhance static and dynamic balance, initiate gait training, and promote independence in ADLs.",
        "exercises": [
          {
            "name": "Supported Standing and Weight Shifting",
            "instructions": "Patient stands with support (e.g., parallel bars or therapist assist). Encourage weight-bearing through the paretic leg. Progress to gentle weight shifts side-to-side and forward-backward to improve proprioception and balance.",
            "dosage": "Hold standing for 1-5 minutes, 3-5 times. Weight shifts: 10-15 repetitions per direction, 2-3 sets.",
            "image_description": "A patient standing in parallel bars, bearing weight through their paretic leg, possibly performing small weight shifts. A therapist is guarding them."
          },
          {
            "name": "Gait Training with Parallel Bars/Walker",
            "instructions": "Using parallel bars or a walker, instruct patient in step-through or modified swing-through gait patterns. Focus on equal step length, controlled limb placement, and proper heel strike/toe off. Progress to less support.",
            "dosage": "Walk 50-100 feet, 3-5 repetitions, 2-3 times daily, gradually increasing distance and reducing assistance.",
            "image_description": "A patient walking within parallel bars or using a front-wheeled walker, taking careful steps. A therapist is walking alongside, providing verbal cues and physical assistance as needed."
          },
          {
            "name": "Functional Reaching and Grasping",
            "instructions": "Patient practices reaching for and grasping objects of various sizes and weights (e.g., blocks, cups) placed at different heights and distances. Focus on controlled movement and proper hand placement. Use affected arm primarily.",
            "dosage": "10-15 repetitions per task, 2-3 sets, 1-2 times daily.",
            "image_description": "A patient sitting at a table, using their paretic arm and hand to reach for and grasp different sized objects (e.g., a cone, a small block, a pen), placing them in a designated spot."
          },
          {
            "name": "Supported Single Leg Stance",
            "instructions": "While holding onto a stable surface (e.g., parallel bars, counter), instruct the patient to lift the non-paretic leg slightly off the floor, bearing weight primarily on the paretic leg. Focus on maintaining balance and control. Progress to unsupported.",
            "dosage": "Hold for 5-10 seconds, 5-10 repetitions, 2-3 sets per day.",
            "image_description": "A patient standing, holding onto a stable surface, lifting one leg slightly off the ground, focusing on balance on the standing leg. A therapist is nearby for safety."
          }
        ]
      },
      "phase_3": {
        "name": "Advanced Functional Training and Community Reintegration",
        "goal": "Maximize functional independence, improve endurance, refine fine motor skills, enhance dynamic balance, and facilitate safe community ambulation and participation in recreational activities.",
        "exercises": [
          {
            "name": "Community Ambulation & Obstacle Course",
            "instructions": "Practice walking on varied surfaces (grass, gravel), ascending/descending ramps and stairs, navigating around obstacles, and performing dual-task activities (e.g., walking while carrying an object or conversing).",
            "dosage": "Walk for 15-30 minutes, 2-3 times daily. Obstacle course: 5-10 repetitions.",
            "image_description": "A patient walking outdoors on a paved path or inside a gym over small obstacles (e.g., cones, steps), demonstrating improved gait control. A therapist is observing from a short distance."
          },
          {
            "name": "Dynamic Balance & Agility Drills",
            "instructions": "Incorporate activities such as tandem walking, heel-to-toe walking, walking backward, side-stepping, stepping over obstacles, and performing turns. Use balance boards or foam pads for increased challenge.",
            "dosage": "10-15 minutes, 2-3 times daily.",
            "image_description": "A patient performing tandem walking or stepping sideways over small cones. They might be on a foam pad or balance board for increased difficulty."
          },
          {
            "name": "Fine Motor Manipulation & Coordination",
            "instructions": "Practice tasks requiring precise hand and finger movements such as buttoning clothes, zipping, picking up small coins, manipulating pegs in a board, using cutlery, or typing. May incorporate constraint-induced movement therapy (CIMT) principles.",
            "dosage": "15-30 minutes, 2-3 times daily.",
            "image_description": "Close-up of a patient's hand attempting to pick up small coins, button a shirt, or place small pegs into a pegboard. The paretic hand is actively engaged."
          },
          {
            "name": "Aerobic and Endurance Training",
            "instructions": "Engage in continuous low-to-moderate intensity activities such as cycling (stationary bike), arm ergometry, or prolonged walking. Monitor heart rate and perceived exertion.",
            "dosage": "20-30 minutes, 3-5 times per week, at 60-80% of target heart rate.",
            "image_description": "A patient on a stationary bicycle or arm ergometer, performing continuous exercise. They appear focused and engaged in the activity."
          }
        ]
      }
    },
    "clinical_notes": {
      "assessment_diagnosis": "Thorough neurological examination focusing on motor function (e.g., Fugl-Meyer Assessment, Brunnstrom Stages), sensation, tone (e.g., Modified Ashworth Scale), balance (e.g., Berg Balance Scale, Tinetti), gait (e.g., 10-meter walk test), and functional independence (e.g., FIM, Modified Rankin Scale). Identify specific deficits, compensatory strategies, and patient-centered goals. Neuroimaging (CT/MRI) confirms stroke location and extent.",
      "manual_therapy": "May include soft tissue mobilization to address spasticity, muscle guarding, or pain. Joint mobilizations can be used to maintain or improve joint range of motion (especially shoulder, wrist, ankle). Gentle stretching of tight muscles to prevent contractures. Proprioceptive neuromuscular facilitation (PNF) techniques can facilitate movement patterns and improve motor control.",
      "precautions": "Monitor vital signs (blood pressure, heart rate) closely during all activities. Guard carefully against falls, especially during balance and gait training. Be aware of signs of fatigue, overexertion, and changes in cognitive status. Prevent skin breakdown in patients with impaired sensation or mobility. Manage spasticity effectively to prevent contractures and pain. Educate patient and caregivers on proper body mechanics, transfer techniques, and home safety modifications. Watch for shoulder subluxation and central post-stroke pain."
    },
    "scientific_reference": "Winstein CJ, Stein J, Arena R, et al. Guidelines for Adult Stroke Rehabilitation and Recovery: A Guideline for Healthcare Professionals From the American Heart Association/American Stroke Association. Stroke. 2016;47(6):e98-e169."
  },
  {
    "condition_name": "Bell's Palsy",
    "category": "Neurology",
    "clinical_presentation": {
      "definition": "Bell's Palsy is an acute, idiopathic, unilateral facial paralysis resulting from inflammation or damage to the facial nerve (cranial nerve VII). It is characterized by sudden onset of weakness or paralysis of the muscles on one side of the face, leading to difficulty with eye closure, smiling, eyebrow movement, and speech articulation. Taste sensation and tear/saliva production may also be affected.",
      "image_description": "A person exhibiting unilateral facial drooping on the left side, with an inability to fully close the left eye. The mouth corner on the affected side is lower, and the forehead appears smooth due to difficulty raising the eyebrow."
    },
    "electrotherapy": [
      {
        "type": "Neuromuscular Electrical Stimulation (NMES)",
        "parameters": "Frequency: 20-50 Hz; Pulse Duration: 150-300 µs; On/Off Time: 1:3 to 1:5 ratio (e.g., 5 seconds on, 15-25 seconds off); Ramp Time: 1-2 seconds; Intensity: To elicit a visible, comfortable muscle contraction without pain or excessive overflow to unaffected muscles.",
        "placement_guide": "Small electrodes placed over the motor points of affected facial muscles (e.g., frontalis for eyebrow elevation, orbicularis oculi for eye closure, zygomaticus major for smile, orbicularis oris for lip pucker). One electrode near the muscle belly, the other more distally or proximally along the muscle or over the nerve trunk if accessible.",
        "goal": "To prevent muscle atrophy, maintain muscle viability, facilitate motor unit recruitment, and promote re-education of specific facial muscle contractions. Used especially in cases of severe paralysis to prevent denervation changes.",
        "image_description": "Close-up of a person's face with small, circular electrodes strategically placed over key facial muscles on one side, connected to an NMES device."
      }
    ],
    "therapeutic_exercises": {
      "phase_1": {
        "name": "Initial Protection & Gentle Stimulation (Acute/Early Subacute - 0-3 Weeks)",
        "goal": "Protect the eye, maintain facial muscle awareness, prevent contractures, and avoid overexertion to minimize synkinesis. Focus on passive/assisted movements.",
        "exercises": [
          {
            "name": "Eye Protection Education & Practice",
            "instructions": "Educate patient on the importance of frequent lubricating eye drops (every 2-4 hours), eye ointment at night, and taping the eye shut during sleep. Practice gentle manual assistance to close the eye periodically.",
            "dosage": "As needed throughout the day and night.",
            "image_description": "A person applying lubricating eye drops, and a separate image demonstrating how to gently tape the eyelid shut with medical tape."
          },
          {
            "name": "Gentle Facial Massage",
            "instructions": "Using fingertips, gently massage the affected facial muscles in an upward and outward direction. Focus on relaxation and stimulating circulation. Avoid vigorous rubbing.",
            "dosage": "5-10 minutes, 2-3 times/day.",
            "image_description": "Close-up of hands gently massaging a person's cheek and forehead with fingertips."
          },
          {
            "name": "Mirror Biofeedback (Passive/Assisted)",
            "instructions": "Standing in front of a mirror, gently assist the affected side of the face into various expressions (e.g., gently push up the corner of the mouth for a slight smile, gently lift the eyebrow). Focus on the sensation and symmetry with the unaffected side without actively straining.",
            "dosage": "5-10 repetitions per movement, 2-3 times/day.",
            "image_description": "A person gently using their fingers to assist the corner of their mouth upwards while looking in a mirror."
          },
          {
            "name": "Passive Stretching for Unaffected Side",
            "instructions": "If tightness or contractures begin to develop on the unaffected side due to overactivity, gently stretch these muscles to maintain balance.",
            "dosage": "Hold for 15-30 seconds, 3-5 repetitions, 1-2 times/day.",
            "image_description": "A person gently stretching the corner of their mouth downwards on the unaffected side."
          }
        ]
      },
      "phase_2": {
        "name": "Facial Muscle Re-education & Strengthening (Subacute - 3 Weeks to 3 Months)",
        "goal": "Improve muscle strength, symmetry, and coordination. Begin active isolated movements and address early signs of synkinesis. Focus on quality of movement.",
        "exercises": [
          {
            "name": "Active Isolated Facial Exercises",
            "instructions": "Perform slow, controlled movements targeting specific facial muscles. Focus on isolating the movement and achieving symmetry with the unaffected side. Examples: gentle eyebrow raises, slight wrinkle of the nose, subtle lip pucker, gentle half-smile. Avoid straining or mass movements.",
            "dosage": "10-15 repetitions per movement, 3-5 sets, 2-3 times/day.",
            "image_description": "Series of images showing a person gently raising one eyebrow, then pucker their lips, and then attempt a soft smile, all while looking in a mirror."
          },
          {
            "name": "Proprioceptive Neuromuscular Facilitation (PNF) for Facial Muscles",
            "instructions": "Apply light resistance with fingertips to the affected muscle during its contraction (e.g., lightly resist eyebrow raise, lip pucker). This helps to 'wake up' the muscle and improve motor control.",
            "dosage": "5-10 repetitions with light resistance, 2-3 times/day.",
            "image_description": "A therapist or patient's hand gently applying resistance to the forehead as the patient attempts to raise their eyebrow."
          },
          {
            "name": "Timed Hold Exercises",
            "instructions": "Perform a gentle, controlled facial expression (e.g., a slight smile) and hold it for 3-5 seconds, focusing on maintaining symmetry. Gradually increase hold time as control improves.",
            "dosage": "10-15 repetitions, 2-3 times/day.",
            "image_description": "A person holding a gentle, symmetrical half-smile while looking in a mirror."
          },
          {
            "name": "Biofeedback with Mirror or EMG (if available)",
            "instructions": "Use a mirror or an EMG device to provide immediate feedback on muscle activation, helping the patient to identify and correct asymmetrical or synkinetic movements.",
            "dosage": "10-15 minutes, 2-3 times/day.",
            "image_description": "A person observing their facial movements in a mirror during an exercise, or a person with small electrodes connected to an EMG machine displaying muscle activity on a screen."
          }
        ]
      },
      "phase_3": {
        "name": "Advanced Coordination & Synkinesis Management (Chronic/Recovery - 3 Months Onwards)",
        "goal": "Refine motor control, address residual deficits, manage synkinesis, and integrate facial function into emotional expression and daily activities for optimal functional and aesthetic outcome.",
        "exercises": [
          {
            "name": "Complex Facial Expressions & Emotional Tasks",
            "instructions": "Practice combined, natural facial movements involved in emotional expression (e.g., expressing surprise, sadness, anger, joy). Focus on fluidity and symmetry in dynamic movements. Integrate into storytelling or role-playing.",
            "dosage": "10-15 repetitions of various expressions, 2-3 times/day.",
            "image_description": "A person expressing a range of emotions (e.g., surprise, slight frown, genuine smile) in front of a mirror."
          },
          {
            "name": "Mass Movement Reduction Techniques (for Synkinesis)",
            "instructions": "If synkinesis (unwanted co-contraction, e.g., eye closing when smiling) is present, practice isolating the desired movement while consciously relaxing the synkinetic muscle. For example, practice smiling while keeping the eye wide open, or closing the eye without moving the mouth.",
            "dosage": "10-15 repetitions focusing on inhibition, 2-3 times/day.",
            "image_description": "A person attempting to smile while consciously trying to keep their affected eye from closing, demonstrating focused control."
          },
          {
            "name": "Speech and Articulation Exercises",
            "instructions": "Practice clear pronunciation of vowels and consonants, especially labial sounds (p, b, m, w, f, v) and lingual sounds (t, d, l, n, s, z). Read aloud, practice tongue twisters.",
            "dosage": "5-10 minutes, 2-3 times/day.",
            "image_description": "A person speaking clearly into a mirror, focusing on mouth and lip movements for articulation."
          },
          {
            "name": "Functional Integration & Daily Activities",
            "instructions": "Consciously incorporate improved facial movements into daily tasks: eating (chewing equally on both sides, managing food in mouth), drinking (using a straw, sipping from a cup without leakage), talking, laughing, and interacting socially. Practice strategies for managing oral incompetence.",
            "dosage": "Throughout daily activities.",
            "image_description": "A person drinking from a straw, demonstrating good lip closure and control, and another image of a person smiling naturally during a conversation."
          }
        ]
      }
    },
    "clinical_notes": {
      "assessment_diagnosis": "Diagnosis is primarily clinical, based on sudden onset unilateral facial weakness/paralysis, absence of other neurological deficits (e.g., limb weakness, sensory loss), and no identifiable cause (e.g., stroke, tumor). Key assessment tools include: House-Brackmann Facial Nerve Grading Scale (I-VI) for objective quantification of paralysis severity; visual observation of facial symmetry at rest and during voluntary movements; assessment of taste (anterior two-thirds of tongue) and lacrimation. Electrophysiological studies (Nerve Conduction Study, EMG) may be used to assess nerve integrity and prognosis, especially in severe cases.",
      "manual_therapy": "Phase 1: Gentle effleurage and petrissage massage to maintain circulation, reduce edema, and increase patient's proprioceptive awareness of facial muscles. Phase 2-3: Soft tissue mobilization, gentle stretching of any developing tightness or contractures (especially on the unaffected side or around the jaw/neck to ensure optimal alignment). Myofascial release techniques may be used for specific areas of tightness or synkinetic bands, often focusing on the platysma, masseter, and temporalis if contributing to compensatory patterns or pain.",
      "precautions": "1. Eye Protection: Crucial to prevent corneal abrasions or ulcers due to incomplete eye closure and reduced tear production. Educate on artificial tears, eye ointment, and taping the eye shut at night. 2. Avoid Overexertion: Early vigorous exercise or high-intensity electrical stimulation can potentially worsen nerve recovery or increase the risk of synkinesis (unwanted co-contraction of muscles). Movements should be gentle and controlled. 3. Synkinesis Monitoring: Continuously monitor for signs of synkinesis. Early intervention with specific re-education techniques is vital to manage it. 4. Pain/Discomfort: Discontinue any exercise or modality if it causes increased pain, discomfort, or exacerbates symptoms. 5. Environmental Factors: Protect face from extreme cold or wind, which can sometimes irritate the nerve.",
      "scientific_reference": "Facial Nerve Paralysis: A Clinical Guideline for Rehabilitation. Journal of Neurological Physical Therapy, 2013, Vol. 37, No. 2, pp. 69–75. doi: 10.1097/NPT.0b013e31828d5410. (General reference type for rehabilitation guidelines)"
    }
  },
  {
    "condition_name": "Cerebral Palsy (Spastic) - Pediatrics",
    "category": "Pediatric Neurological Rehabilitation",
    "clinical_presentation": {
      "definition": "Spastic Cerebral Palsy (CP) in pediatrics is a chronic neurological condition characterized by increased muscle tone (spasticity) due to damage to the motor cortex or pyramidal tracts in the developing brain. This leads to stiff, exaggerated movements and difficulty with motor control, balance, and coordination. The affected limbs may present with contractures, weakness, and altered gait patterns (e.g., scissoring gait, toe walking). Severity and distribution (hemiplegia, diplegia, quadriplegia) vary widely among individuals.",
      "image_description": "A young child, approximately 4-6 years old, with spastic diplegic cerebral palsy, attempting to walk with a forward-leaning posture and scissoring gait, possibly using a walker or crutches. Their leg muscles appear tight and their feet may be turned inward. A physical therapist is gently guiding and supporting them during a therapy session."
    },
    "electrotherapy": [
      {
        "type": "Functional Electrical Stimulation (FES)",
        "parameters": "Biphasic pulsed current; Frequency: 30-50 Hz; Pulse Duration: 200-300 µs; Intensity: To achieve a functional muscle contraction without discomfort (motor threshold); On/Off Ratio: Timed to specific phases of movement (e.g., swing phase for gait).",
        "placement_guide": "Electrodes placed over the motor point of weak or antagonist muscles. For example, to assist dorsiflexion during gait, electrodes are typically placed over the tibialis anterior muscle belly and the common peroneal nerve.",
        "goal": "To improve muscle strength, facilitate functional movement patterns (e.g., improve foot clearance during gait by activating dorsiflexors), reduce spasticity indirectly through reciprocal inhibition, and enhance motor learning.",
        "image_description": "A child with small surface electrodes placed on their lower leg (anterior compartment) while they are performing a walking task, possibly with the assistance of a physical therapist or a gait trainer. The FES device is visible."
      }
    ],
    "therapeutic_exercises": {
      "phase_1": {
        "name": "Early Intervention & Foundational Skills (Infancy to Early Childhood)",
        "goal": "To facilitate head and trunk control, promote anti-gravity movements, prevent secondary impairments (contractures, deformities), reduce abnormal tone, and encourage early sensorimotor development.",
        "exercises": [
          {
            "name": "Therapeutic Handling & Positioning",
            "instructions": "Educate parents on optimal positions (e.g., prone, side-lying) that inhibit abnormal tone and reflexes, facilitate symmetrical movement, and encourage midline orientation. Use gentle weight-bearing through extremities.",
            "dosage": "Throughout daily activities, with multiple short sessions.",
            "image_description": "A physical therapist or parent gently positioning an infant with CP in a side-lying position, facilitating hand-to-mouth exploration and midline play."
          },
          {
            "name": "Gentle Passive & Active-Assistive Range of Motion (PROM/AAROM)",
            "instructions": "Perform slow, sustained stretches on spastic muscles (e.g., hamstrings, adductors, gastrocnemius). Encourage active movement of antagonist muscles or limbs with assistance.",
            "dosage": "3-5 repetitions, holding each stretch for 30-60 seconds, 2-3 times per day.",
            "image_description": "A physical therapist gently stretching a child's hamstring muscle, ensuring the stretch is slow and sustained, with the child lying supine."
          },
          {
            "name": "Prone Propping & Rolling Facilitation",
            "instructions": "Place the child in prone to encourage head lifting and weight-bearing through forearms. Facilitate segmental rolling from supine to prone and vice versa using key points of control.",
            "dosage": "5-10 minutes, several times a day, incorporated into play.",
            "image_description": "An infant with CP in a prone position on a mat, supported on their forearms, lifting their head, with a therapist providing gentle assistance or toys for engagement."
          },
          {
            "name": "Supported Sitting Balance",
            "instructions": "Practice sitting with external support (e.g., corner chair, therapist's hands) gradually reducing assistance to encourage independent trunk control and weight shifts in sitting.",
            "dosage": "5-10 minutes, 2-3 times per day.",
            "image_description": "A child with CP sitting independently on a small bench or mat, maintaining an upright posture with minimal support, reaching for toys."
          }
        ]
      },
      "phase_2": {
        "name": "Functional Skill Development & Mobility (Early to Middle Childhood)",
        "goal": "To develop independent transitional movements, improve mobility (crawling, cruising, walking), enhance balance, strength, and coordination for increased functional independence.",
        "exercises": [
          {
            "name": "Quadruped Crawling/Creeping",
            "instructions": "Facilitate reciprocal weight shifts and limb advancement in quadruped. Use tactile cues and playful motivation to encourage movement across various surfaces.",
            "dosage": "10-15 minutes, 2-3 times per day, integrated into play.",
            "image_description": "A child on their hands and knees, actively crawling on a mat, with the physical therapist providing gentle tactile cues to facilitate reciprocal movement."
          },
          {
            "name": "Sit-to-Stand Transitions",
            "instructions": "Practice transitioning from sitting to standing from various heights (e.g., low chair, stool), focusing on symmetrical weight bearing and controlled movement. Use assistive devices as needed.",
            "dosage": "10-15 repetitions, 2-3 sets, 3-5 times per week.",
            "image_description": "A child performing a sit-to-stand transfer from a child-sized chair, with a therapist providing verbal cues and minimal physical assistance."
          },
          {
            "name": "Gait Training (with/without assistive devices)",
            "instructions": "Practice walking in parallel bars, with a walker, or crutches. Focus on appropriate foot placement (heel strike, toe-off), reciprocal arm swing, and achieving adequate step length and clearance. May use orthoses (AFOs) as prescribed.",
            "dosage": "15-20 minutes, 2-3 times per day.",
            "image_description": "A child walking using a posterior walker, with a physical therapist walking beside them, providing guidance and guarding. The child's legs are moving in a more symmetrical pattern."
          },
          {
            "name": "Balance Training",
            "instructions": "Engage in static and dynamic balance activities: standing on uneven surfaces (foam, rocker board), single leg stance with support, throwing/catching a ball while standing, tandem stance.",
            "dosage": "5-10 minutes, 2-3 times per day.",
            "image_description": "A child standing on a soft foam pad, trying to maintain balance, with a therapist close by for safety and verbal encouragement."
          },
          {
            "name": "Targeted Strengthening Exercises",
            "instructions": "Perform exercises to strengthen antagonist muscles to spastic ones, and key muscle groups for functional movements (e.g., hip abductors, knee extensors, dorsiflexors, core). Use body weight, resistance bands, or light weights.",
            "dosage": "10-15 repetitions, 2-3 sets, 3-5 times per week.",
            "image_description": "A child performing a modified squat or step-up onto a low box, demonstrating active muscle engagement in their legs."
          }
        ]
      },
      "phase_3": {
        "name": "Advanced Functional Integration & Community Participation (Middle Childhood to Adolescence)",
        "goal": "To optimize endurance, speed, agility, and complex motor skills. Promote participation in age-appropriate recreational activities, sports, and community mobility, preparing for maximum independence.",
        "exercises": [
          {
            "name": "Endurance Training",
            "instructions": "Engage in activities that improve cardiovascular fitness and muscular endurance such as walking on treadmill/outdoors, cycling (stationary or adapted bike), swimming, or active wheelchair propulsion.",
            "dosage": "20-30 minutes, 3-5 times per week, at a moderate intensity.",
            "image_description": "An adolescent with CP cycling on an adapted stationary bicycle, demonstrating sustained effort and good posture."
          },
          {
            "name": "Agility & Coordination Drills",
            "instructions": "Implement obstacle courses, cone drills, ladder drills, ball handling skills (kicking, throwing, catching), and activities requiring quick changes in direction and speed.",
            "dosage": "15-20 minutes, 3-4 times per week.",
            "image_description": "A child navigating a simple obstacle course with cones and low hurdles, demonstrating improved motor planning and coordination."
          },
          {
            "name": "Stair Climbing & Uneven Terrain Navigation",
            "instructions": "Practice ascending and descending stairs with varying degrees of support (handrail, no handrail). Walk on grass, gravel, ramps, and slopes to improve adaptability and balance on diverse surfaces.",
            "dosage": "10-15 minutes, 2-3 times per week.",
            "image_description": "An adolescent with CP confidently climbing a set of stairs independently, using a handrail if needed."
          },
          {
            "name": "Adapted Sports & Recreational Activities",
            "instructions": "Encourage participation in team sports (e.g., wheelchair basketball, adaptive soccer), individual sports (swimming, track and field), or other recreational pursuits that promote physical activity and social engagement.",
            "dosage": "Regular participation (e.g., 2-3 times per week).",
            "image_description": "A group of children and adolescents, some using wheelchairs, actively participating in an adapted sports game like wheelchair basketball, showing teamwork and enjoyment."
          },
          {
            "name": "Advanced Balance & Proprioception",
            "instructions": "Perform exercises such as standing on one leg for extended periods, walking heel-to-toe, standing on a wobble board or Bosu ball, and performing dynamic tasks while balancing.",
            "dosage": "5-10 minutes, 3-4 times per week.",
            "image_description": "A child standing on a Bosu ball, maintaining balance while attempting to catch a soft ball, with a therapist providing close supervision."
          }
        ]
      }
    },
    "clinical_notes": {
      "assessment_diagnosis": "A comprehensive assessment is crucial, including Gross Motor Function Classification System (GMFCS) level, Manual Ability Classification System (MACS), range of motion (ROM), spasticity assessment (Modified Ashworth Scale), muscle strength testing, postural analysis, gait analysis (if ambulatory), functional mobility skills, pain assessment, and evaluation of assistive technology needs (orthoses, walkers, wheelchairs, standers). Ongoing assessment guides progression and adaptations.",
      "manual_therapy": "Neurodevelopmental Treatment (NDT) principles emphasizing facilitation of normal movement patterns and inhibition of abnormal tone. Sustained, gentle stretching for spastic muscles to improve ROM and reduce contracture risk. Joint mobilizations to address capsular restrictions. Soft tissue mobilization for tight fascia and muscles. Manual facilitation of movement to encourage active participation and motor learning.",
      "precautions": "Avoid over-stretching or ballistic stretching of spastic muscles as this can increase tone or cause injury. Monitor for signs of fatigue, pain, or discomfort. Ensure proper fit and use of orthoses and assistive devices to prevent skin breakdown or secondary complications. Be aware of seizure precautions for individuals with co-occurring epilepsy. Activities should always be geared towards functional goals and integrated into play for pediatric compliance."
    },
    "scientific_reference": "Campbell, S. K., Palisano, R. J., & Orlin, M. N. (Eds.). (2020). Campbell's Physical Therapy for Children (6th ed.). Elsevier."
  },
  {
    "condition_name": "Sciatica",
    "category": "Orthopedics",
    "clinical_presentation": {
      "definition": "Sciatica is a common type of pain affecting the sciatic nerve, which extends from the lower back down through the hips and buttocks and down each leg. It is typically caused by compression or irritation of the sciatic nerve or its roots, most commonly due to a herniated lumbar disc, spinal stenosis, piriformis syndrome, or spondylolisthesis.",
      "image_description": "Anatomical diagram showing the sciatic nerve pathway from the lumbar spine through the buttock and down the leg, with an arrow pointing to a compressed nerve root in the lower back."
    },
    "electrotherapy": [
      {
        "type": "Transcutaneous Electrical Nerve Stimulation (TENS)",
        "parameters": "High-frequency (conventional TENS): 80-120 Hz, pulse width 50-100 µs, intensity to produce strong but comfortable paresthesia without muscle contraction. Duration: 30-60 minutes, 2-3 times/day as needed for pain relief.",
        "placement_guide": "Place electrodes along the sciatic nerve pathway, typically one electrode over the lumbar spine near the nerve root irritation and the other distal along the affected leg (e.g., gluteal region, posterior thigh, or calf), or directly over the painful area.",
        "goal": "Pain modulation and reduction of nerve-related discomfort.",
        "image_description": "Diagram showing TENS electrode placement for sciatica, with electrodes on the lower back and posterior thigh of the affected leg."
      }
    ],
    "therapeutic_exercises": {
      "phase_1": {
        "name": "Acute Pain Relief and Gentle Mobility",
        "goal": "Reduce pain and inflammation, improve pain-free range of motion, and initiate neural mobility.",
        "exercises": [
          {
            "name": "Knee-to-Chest Stretch (Single)",
            "instructions": "Lie on your back with knees bent, feet flat. Gently bring one knee towards your chest, holding behind the thigh or over the shin. Hold for 20-30 seconds. Do not push into pain.",
            "dosage": "3-5 repetitions per leg, 2-3 times/day.",
            "image_description": "Person lying supine, gently pulling one knee towards the chest."
          },
          {
            "name": "Pelvic Tilts",
            "instructions": "Lie on your back with knees bent, feet flat. Gently flatten your lower back into the floor by contracting your abdominal muscles and tilting your pelvis upwards. Hold for 5 seconds, then relax. Keep breathing naturally.",
            "dosage": "10-15 repetitions, 2-3 times/day.",
            "image_description": "Person lying supine, demonstrating a pelvic tilt by flattening the lower back."
          },
          {
            "name": "Sciatic Nerve Glides (Slump Sit)",
            "instructions": "Sit on the edge of a chair. Slump your back, then straighten one leg with your foot dorsiflexed (toes pointed up). Gently extend your neck (look up) while extending your leg, then flex your neck (look down) while bending your knee. Coordinate the movements smoothly. Perform within pain-free range.",
            "dosage": "10-15 repetitions per leg, 1-2 times/day.",
            "image_description": "Person sitting on a chair, performing a sciatic nerve glide with one leg extended and neck movement."
          }
        ]
      },
      "phase_2": {
        "name": "Sub-Acute Strengthening and Stability",
        "goal": "Restore full pain-free range of motion, improve core stability, and introduce gentle strengthening.",
        "exercises": [
          {
            "name": "Piriformis Stretch",
            "instructions": "Lie on your back with knees bent, feet flat. Cross one ankle over the opposite knee. Gently pull the bottom knee towards your chest until you feel a stretch in the buttock of the crossed leg. Hold for 20-30 seconds.",
            "dosage": "3-5 repetitions per side, 2 times/day.",
            "image_description": "Person lying supine, performing a piriformis stretch by crossing one leg over the other and pulling the bottom knee."
          },
          {
            "name": "Bird-Dog",
            "instructions": "Start on all fours, hands under shoulders, knees under hips. Keep your back flat and core engaged. Slowly extend one arm forward and the opposite leg straight back, keeping your torso stable. Return to start and alternate sides.",
            "dosage": "10-12 repetitions per side, 2-3 sets.",
            "image_description": "Person on all fours, demonstrating the bird-dog exercise with one arm extended forward and the opposite leg extended back."
          },
          {
            "name": "Glute Bridge",
            "instructions": "Lie on your back with knees bent, feet flat, hip-width apart. Engage your glutes and lift your hips off the floor until your body forms a straight line from shoulders to knees. Hold briefly, then slowly lower. Avoid arching the lower back.",
            "dosage": "10-15 repetitions, 2-3 sets.",
            "image_description": "Person lying supine, performing a glute bridge, lifting hips off the floor."
          }
        ]
      },
      "phase_3": {
        "name": "Advanced Strengthening and Functional Return",
        "goal": "Increase strength and endurance, improve dynamic stability, and prepare for return to full activities.",
        "exercises": [
          {
            "name": "Standing Hamstring Stretch",
            "instructions": "Place one heel on a low surface (e.g., step, chair) with the leg straight. Keep your back straight and gently lean forward from your hips until you feel a stretch in the back of your thigh. Hold for 20-30 seconds.",
            "dosage": "3-5 repetitions per leg, 1-2 times/day.",
            "image_description": "Person standing, performing a hamstring stretch with one heel elevated on a step."
          },
          {
            "name": "Squats (Bodyweight)",
            "instructions": "Stand with feet shoulder-width apart. Keep your chest up and back straight. Lower your hips as if sitting into a chair, ensuring knees track over toes. Go as deep as comfortable without pain. Return to standing.",
            "dosage": "10-15 repetitions, 2-3 sets.",
            "image_description": "Person performing a bodyweight squat, viewed from the side, demonstrating proper form."
          },
          {
            "name": "Walking Lunges",
            "instructions": "Stand tall. Step forward with one leg, lowering your hips until both knees are bent at approximately 90 degrees. Ensure your front knee is over your ankle and the back knee hovers above the floor. Push off the back foot to bring it forward, alternating legs.",
            "dosage": "8-10 repetitions per leg, 2-3 sets.",
            "image_description": "Person performing a walking lunge, mid-stride, viewed from the side."
          }
        ]
      }
    },
    "clinical_notes": {
      "assessment_diagnosis": "Thorough history taking including pain character, aggravating/alleviating factors, neurological symptoms (numbness, tingling, weakness). Physical examination includes neurological assessment (dermatomes, myotomes, reflexes), specific tests like Straight Leg Raise (SLR), Slump Test, Prone Knee Bend. Differential diagnosis to rule out other causes of leg pain. Imaging (MRI) may be indicated for severe/progressive neurological deficits or suspicion of serious pathology.",
      "manual_therapy": "Soft tissue mobilization (e.g., piriformis, gluteals, hamstrings), joint mobilization/manipulation (lumbar spine, SI joint) if indicated by assessment findings and within patient tolerance. Neural mobilization techniques (nerve glides/tensioners) to improve sciatic nerve mobility. Positional distraction for discogenic sciatica.",
      "precautions": "Avoid activities that aggravate pain or centralize symptoms (move pain from leg to back). Patients should be educated on proper body mechanics for lifting, bending, and sitting. Monitor for red flag symptoms (e.g., cauda equina syndrome - bowel/bladder changes, saddle anesthesia, rapidly progressive weakness). Gradually progress exercises and always respect pain-free range of motion. Avoid excessive lumbar flexion or rotation in acute phases.",
      "scientific_reference": "Kisner, C., & Colby, L. A. (2017). Therapeutic Exercise: Foundations and Techniques (7th ed.). F.A. Davis Company."
    }
  },
  {
    "condition_name": "Ankle Sprain - Sports",
    "category": "Orthopedic Sports Injury",
    "clinical_presentation": {
      "definition": "An ankle sprain, particularly common in sports, is an injury to the ligaments supporting the ankle joint, most frequently involving the lateral ligaments (anterior talofibular, calcaneofibular, posterior talofibular) due to an inversion mechanism. It ranges from a mild stretch (Grade I) to a complete tear (Grade III) and is characterized by pain, swelling, bruising, limited range of motion, and difficulty bearing weight. Sports involving jumping, cutting, and uneven surfaces are high-risk activities.",
      "image_description": "A close-up shot of an athlete's ankle, swollen and slightly bruised, with a physical therapist gently palpating the lateral malleolus area, indicating an inversion ankle sprain."
    },
    "electrotherapy": [
      {
        "type": "TENS (Transcutaneous Electrical Nerve Stimulation)",
        "parameters": "Frequency: 80-120 Hz, Pulse Duration: 50-100 µs, Intensity: Sensory level (strong but comfortable tingling), Duration: 30-60 minutes, as needed for pain.",
        "placement_guide": "Electrodes placed around the painful area of the ankle, often superior and inferior to the lateral malleolus or directly over the swollen area.",
        "goal": "Pain modulation by stimulating A-beta fibers, activating the pain gate theory.",
        "image_description": "Two electrodes placed on an ankle: one just superior to the lateral malleolus and one inferior, connected to a small TENS unit."
      },
      {
        "type": "IFC (Interferential Current)",
        "parameters": "Frequency: 4000 Hz carrier frequency, Beat Frequency: 80-150 Hz (for pain) or 1-10 Hz (for muscle pump/edema), Intensity: Strong but comfortable sensation, Duration: 15-20 minutes.",
        "placement_guide": "Quadripolar setup with electrodes placed diagonally around the ankle joint, ensuring the currents intersect at the pain site.",
        "goal": "Pain relief, reduction of edema (with lower beat frequencies), and muscle relaxation.",
        "image_description": "Four electrodes placed in a cross pattern around an ankle joint, with wires leading to an IFC device."
      },
      {
        "type": "NMES (Neuromuscular Electrical Stimulation)",
        "parameters": "Frequency: 30-50 Hz, Pulse Duration: 200-300 µs, On/Off Ratio: 1:3 to 1:5 (e.g., 10s on, 30s off), Intensity: To elicit a strong visible contraction without pain, Duration: 10-15 contractions, 2-3 sets.",
        "placement_guide": "Electrodes placed over motor points of weak muscles, e.g., peroneus longus and brevis for eversion, or tibialis anterior for dorsiflexion.",
        "goal": "Prevent muscle atrophy, improve muscle strength, facilitate muscle re-education, especially for evertor muscles often weakened post-sprain.",
        "image_description": "Two electrodes placed over the belly of the peroneus muscles on the lateral lower leg, with the ankle slightly dorsiflexed."
      }
    ],
    "therapeutic_exercises": {
      "phase_1": {
        "name": "Acute Protection and Early Mobilization Phase (Days 1-7/10)",
        "goal": "Control pain and swelling, protect the injured ligaments, maintain non-weight-bearing/partial weight-bearing mobility, prevent muscle atrophy in uninjured muscles, and initiate gentle range of motion.",
        "exercises": [
          {
            "name": "Rest, Ice, Compression, Elevation (RICE)",
            "instructions": "Rest the ankle from aggravating activities. Apply ice packs for 15-20 minutes every 2-3 hours. Use an elastic bandage or brace for compression. Elevate the ankle above heart level as much as possible.",
            "dosage": "Ongoing as needed for pain and swelling.",
            "image_description": "An ankle elevated on pillows with an ice pack wrapped in a cloth, secured by an elastic bandage."
          },
          {
            "name": "Ankle Alphabet Exercises",
            "instructions": "Gently move the ankle to draw each letter of the alphabet with your big toe. Perform within pain-free limits. Focus on dorsiflexion, plantarflexion, inversion, and eversion.",
            "dosage": "2-3 sets of 1-2 repetitions of the alphabet, 3-5 times per day.",
            "image_description": "A person sitting with their leg extended, subtly moving their foot to spell out letters in the air."
          },
          {
            "name": "Isometric Ankle Holds",
            "instructions": "Gently press your foot against a stable surface (wall, opposite foot, therapist's hand) in all four directions (dorsiflexion, plantarflexion, inversion, eversion). Hold for 5-10 seconds. No movement should occur.",
            "dosage": "10 repetitions of 5-10 second holds for each direction, 2-3 times per day.",
            "image_description": "A person's foot pressing against a wall for an isometric dorsiflexion exercise, demonstrating no joint movement."
          }
        ]
      },
      "phase_2": {
        "name": "Strength, Proprioception, and Graded Weight-Bearing Phase (Weeks 2-6)",
        "goal": "Restore full pain-free range of motion, improve ankle strength (especially evertors), enhance proprioception and balance, and progress to full weight-bearing with normal gait.",
        "exercises": [
          {
            "name": "Ankle Resistance Band Strengthening",
            "instructions": "Using a light to moderate resistance band, perform plantarflexion, dorsiflexion, inversion, and eversion exercises. Secure the band appropriately for each movement. Focus on controlled movements.",
            "dosage": "3 sets of 10-15 repetitions for each direction, 1-2 times per day.",
            "image_description": "A person's foot hooked into a resistance band, pulling against it for ankle eversion, demonstrating proper technique."
          },
          {
            "name": "Single Leg Balance",
            "instructions": "Stand on the injured leg, maintaining balance. Start with eyes open, progress to eyes closed, and eventually on an unstable surface (e.g., pillow, foam pad, balance board).",
            "dosage": "3 sets of 30-60 second holds, 1-2 times per day.",
            "image_description": "An individual standing on one leg with a stable posture, focusing on balance, with hands on hips."
          },
          {
            "name": "Bilateral to Unilateral Calf Raises",
            "instructions": "Start with standing on both feet, raising onto the balls of your feet. Progress to single leg calf raises on the injured side. Control the lowering phase.",
            "dosage": "3 sets of 10-15 repetitions, 1 time per day.",
            "image_description": "A person performing a single-leg calf raise, standing tall on the ball of their foot."
          },
          {
            "name": "Controlled Lunges",
            "instructions": "Perform forward and lateral lunges, ensuring proper knee alignment over the foot and controlled ankle stability. Start with shallow depth.",
            "dosage": "3 sets of 10-12 repetitions per leg, 1 time per day.",
            "image_description": "An individual performing a lateral lunge, showing controlled movement and good form."
          }
        ]
      },
      "phase_3": {
        "name": "Advanced Sport-Specific and Plyometric Training Phase (Weeks 6-12+)",
        "goal": "Achieve maximal ankle strength, power, agility, and sport-specific function. Progress to plyometric and cutting drills. Ensure psychological readiness for return to sport.",
        "exercises": [
          {
            "name": "Plyometric Drills (Hopping/Jumping)",
            "instructions": "Start with bilateral hops, progressing to unilateral hops (forward, lateral, diagonal). Incorporate box jumps (low to higher) and jump landing mechanics. Focus on soft, controlled landings.",
            "dosage": "3 sets of 10-15 repetitions or 30-60 seconds, 2-3 times per week.",
            "image_description": "An athlete performing a low-impact box jump onto a plyometric box, focusing on controlled landing."
          },
          {
            "name": "Agility and Change of Direction Drills",
            "instructions": "Set up cones for various agility patterns (e.g., T-drill, figure-8, shuttle runs). Focus on quick changes of direction, acceleration, and deceleration. Gradually increase speed and complexity.",
            "dosage": "3-5 repetitions of each drill, 2-3 times per week.",
            "image_description": "An athlete weaving through a series of cones on a sports field, demonstrating agility and quick footwork."
          },
          {
            "name": "Sport-Specific Simulation and Drills",
            "instructions": "Incorporate drills specific to the athlete's sport (e.g., dribbling for basketball/soccer, serving for tennis, passing for football, sprinting with turns). Gradually increase intensity and duration, mimicking game situations.",
            "dosage": "Begin with 15-20 minutes, gradually increasing duration and intensity over several sessions, 2-3 times per week.",
            "image_description": "A soccer player gently dribbling a ball around small markers on a pitch, simulating game play."
          },
          {
            "name": "Advanced Unstable Surface Training",
            "instructions": "Utilize wobble boards, Bosu balls, and dynamic balance activities. Incorporate perturbations (e.g., gentle pushes from a therapist while balancing on one leg).",
            "dosage": "3 sets of 30-60 seconds, 1-2 times per day.",
            "image_description": "An athlete standing on one leg on a Bosu ball, maintaining balance, possibly with a therapist providing a slight, controlled push."
          }
        ]
      }
    },
    "clinical_notes": {
      "assessment_diagnosis": "Diagnosis is typically made through subjective history (mechanism of injury), objective examination (palpation for tenderness, swelling, ecchymosis; range of motion assessment; special tests like anterior drawer test and talar tilt test for ligamentous integrity). Ottawa Ankle Rules should be applied to rule out fractures. Grade of sprain (I, II, III) guides prognosis and intervention intensity. Assess gait, balance, and functional limitations.",
      "manual_therapy": "Soft tissue mobilization (STM) to reduce swelling and muscle spasm (e.g., gastrocnemius, soleus, peroneals). Ankle joint mobilizations (e.g., posterior glide of talus, distal tibiofibular joint mobs) to restore accessory motion and improve dorsiflexion. Neuromobilization if neural symptoms are present. Manual resistance during therapeutic exercises.",
      "precautions": "Avoid pain-provoking activities, especially inversion. Gradual progression of weight-bearing and exercises is crucial; do not advance phases prematurely. Monitor for excessive swelling, persistent pain, or signs of instability. Ensure proper footwear. Educate on prophylactic bracing/taping for return to sport. Watch for signs of chronic ankle instability or complex regional pain syndrome.",
      "scientific_reference": "Hertel, J., & Denegar, C. R. (2010). Ankle Sprain: From Acute Injury to Chronic Instability. Journal of Sport Rehabilitation, 19(4), 361-370. (Note: This is a representative reference; specific up-to-date guidelines from professional bodies like APTA, NATA, or specific research articles would be ideal in a real clinical setting.)"
    },
    "scientific_reference": "Hertel, J., & Denegar, C. R. (2010). Ankle Sprain: From Acute Injury to Chronic Instability. Journal of Sport Rehabilitation, 19(4), 361-370. (Note: This is a representative reference; specific up-to-date guidelines from professional bodies like APTA, NATA, or specific research articles would be ideal in a real clinical setting.)"
  },
  {
    "condition_name": "Neck Pain (Cervical Spondylosis)",
    "category": "Orthopedics",
    "clinical_presentation": {
      "definition": "Cervical spondylosis refers to age-related wear and tear affecting the spinal discs in your neck. As the discs dehydrate and shrink, signs of osteoarthritis develop, including bone spurs (osteophytes) and degenerative changes to the facet joints. This often leads to chronic neck pain, stiffness, muscle guarding, and potentially radicular symptoms (pain, numbness, tingling, or weakness) extending into the shoulders, arms, and hands if nerve roots are compressed.",
      "image_description": "A middle-aged individual gently touching the back of their neck with a pained expression, indicating chronic discomfort and stiffness. The person is sitting upright, perhaps at a desk, highlighting potential ergonomic factors."
    },
    "electrotherapy": [
      {
        "type": "TENS (Transcutaneous Electrical Nerve Stimulation)",
        "parameters": "Conventional TENS: Frequency 80-120 Hz, Pulse Width 50-100 µs, Intensity to sensory level (strong but comfortable, no muscle contraction), Duration 30-60 minutes.",
        "placement_guide": "Electrodes placed over the most painful areas of the cervical paraspinal muscles or along the dermatomal distribution of radicular pain.",
        "goal": "Pain modulation and symptomatic pain relief through the gate control theory.",
        "image_description": "Two small square electrodes placed bilaterally over the cervical paraspinal muscles on the posterior neck, with wires connected to a portable TENS unit."
      },
      {
        "type": "IFC (Interferential Current)",
        "parameters": "Carrier frequency 4000 Hz, Beat frequency 80-120 Hz (for pain relief), or 1-10 Hz (for muscle stimulation if indicated), Intensity to comfortable sensory level (or low motor if applicable). Duration 15-20 minutes.",
        "placement_guide": "Four electrodes placed in a criss-cross pattern surrounding the cervical spine or the region of pain to achieve deeper tissue penetration.",
        "goal": "Deep pain relief, reduction of muscle spasm, and improved local circulation.",
        "image_description": "Four electrodes arranged in an 'X' pattern on the posterior neck and upper trapezius area, demonstrating the criss-cross application for Interferential Current."
      },
      {
        "type": "Moist Heat Pack",
        "parameters": "Temperature approximately 160-170°F (71-77°C) for the pack, applied with appropriate toweling layers to prevent burns. Duration 15-20 minutes.",
        "placement_guide": "Placed directly over the cervical and upper trapezius musculature.",
        "goal": "Muscle relaxation, pain relief, increased tissue extensibility, and increased local blood flow to promote healing.",
        "image_description": "A large, rectangular moist heat pack wrapped in several layers of towels, draped over a patient's neck and upper shoulders while they are comfortably lying supine."
      }
    ],
    "therapeutic_exercises": {
      "phase_1": {
        "name": "Acute Pain Management & Gentle Mobility (Weeks 1-2)",
        "goal": "Reduce pain and inflammation, decrease muscle guarding, initiate gentle pain-free range of motion (ROM), and educate on posture.",
        "exercises": [
          {
            "name": "Gentle Cervical AROM (Active Range of Motion)",
            "instructions": "Slowly and gently move the head through pain-free ranges of flexion, extension, rotation (looking left/right), and lateral flexion (ear to shoulder). Avoid forcing into pain. Focus on smooth, controlled movements.",
            "dosage": "10 repetitions in each direction, 2-3 sets, 3-5 times per day.",
            "image_description": "A person demonstrating gentle cervical flexion (chin to chest), then extension (looking up), then rotation (looking over shoulder), and lateral flexion (ear to shoulder) in a seated position."
          },
          {
            "name": "Chin Tucks (Cervical Retraction)",
            "instructions": "Sit or stand tall. Gently pull your chin straight back, as if making a double chin, while keeping your eyes level. Feel a stretch at the back of your neck. Avoid tilting the head up or down.",
            "dosage": "10-15 repetitions, hold for 3-5 seconds, 2-3 sets, 2-3 times per day.",
            "image_description": "A person sitting with good posture, demonstrating the chin tuck exercise, pulling their chin straight back horizontally without tilting the head."
          },
          {
            "name": "Scapular Retractions",
            "instructions": "Sit or stand with good posture. Gently squeeze your shoulder blades together and down, as if trying to hold a pencil between them. Avoid shrugging your shoulders up towards your ears.",
            "dosage": "10-15 repetitions, hold for 3-5 seconds, 2-3 sets, 2-3 times per day.",
            "image_description": "A person in a seated position, retracting their shoulder blades together and slightly down, maintaining good upright posture."
          }
        ]
      },
      "phase_2": {
        "name": "Subacute & Initial Strengthening (Weeks 3-6)",
        "goal": "Improve cervical strength and endurance, enhance postural stability, and increase pain-free ROM.",
        "exercises": [
          {
            "name": "Cervical Isometrics",
            "instructions": "Place your hand on your forehead (flexion), back of head (extension), side of head (lateral flexion), or temple (rotation). Gently push your head into your hand without allowing your head to move. Hold the contraction.",
            "dosage": "5-10 seconds hold, 5-10 repetitions in each direction, 2-3 sets, 1-2 times per day.",
            "image_description": "A person demonstrating cervical isometric exercises, first placing a hand on the forehead to resist flexion, then on the side of the head to resist lateral flexion, showing no head movement."
          },
          {
            "name": "Corner Pec Stretch",
            "instructions": "Stand in a corner with forearms on each wall, elbows slightly below shoulder height. Lean gently into the corner, feeling a stretch across your chest and anterior shoulders. Keep your back straight.",
            "dosage": "Hold for 30-60 seconds, 3 repetitions, 1-2 times per day.",
            "image_description": "A person standing in a room corner, placing their forearms on the walls with elbows bent, leaning forward to stretch the pectoral muscles."
          },
          {
            "name": "Upper Trapezius/Levator Scapulae Stretch",
            "instructions": "For upper traps: Sit tall, gently pull one ear towards the opposite shoulder using the hand on that side. For levator scapulae: Turn head 45 degrees to one side, tuck chin, and gently pull head down towards armpit. Hold the stretch.",
            "dosage": "Hold for 30-60 seconds, 3 repetitions per side, 1-2 times per day.",
            "image_description": "A person demonstrating two stretches: first, gently pulling their head to the side to stretch the upper trapezius; second, turning their head and pulling it towards the armpit to stretch the levator scapulae."
          }
        ]
      },
      "phase_3": {
        "name": "Advanced Strengthening & Functional Return (Weeks 7+)",
        "goal": "Optimize cervical strength, endurance, and proprioception. Integrate functional movements, ergonomic principles, and prepare for return to full activity.",
        "exercises": [
          {
            "name": "Resistance Band Cervical Exercises",
            "instructions": "Using a light resistance band, secure it to a stable object. Perform cervical flexion, extension, lateral flexion, and rotation against the band's resistance. Maintain control and smooth movement.",
            "dosage": "10-15 repetitions, 2-3 sets, 3-4 times per week.",
            "image_description": "A person seated, using a light resistance band looped around their head and secured to a stable object, performing controlled cervical extension against the band's resistance."
          },
          {
            "name": "Thoracic Extension with Foam Roller",
            "instructions": "Lie on your back with a foam roller positioned under your upper to mid-back. Support your head with your hands. Gently extend your upper back over the roller, allowing your chest to open. Roll slightly up and down the thoracic spine.",
            "dosage": "10-15 repetitions, 2-3 sets, 1 time per day.",
            "image_description": "A person lying supine on a foam roller placed horizontally across their mid-back, with hands clasped behind the head, gently extending their spine over the roller."
          },
          {
            "name": "Dynamic Proprioceptive Neck Exercises",
            "instructions": "While standing on an unstable surface (e.g., balance pad or BOSU ball, if appropriate), perform slow, controlled head movements (e.g., looking left/right, up/down, figure-eights) while maintaining balance and trunk stability. Start with eyes open, progress to eyes closed if safe.",
            "dosage": "30-60 seconds, 3-5 sets, 3 times per week.",
            "image_description": "A person standing on a balance pad, slowly moving their head in controlled patterns (e.g., looking left and right) while maintaining overall body balance."
          },
          {
            "name": "Ergonomic Training & Posture Correction",
            "instructions": "Review and modify workstation setup, ensure monitor is at eye level, keyboard/mouse are comfortably accessible. Practice frequent postural breaks (e.g., standing every 30-60 minutes). Educate on proper lifting mechanics and sleeping posture.",
            "dosage": "Ongoing education and implementation in daily activities.",
            "image_description": "An illustration of an ergonomically correct desk setup, showing a computer monitor at eye level, a supportive chair, and a person sitting with good posture."
          }
        ]
      }
    },
    "clinical_notes": {
      "assessment_diagnosis": "Initial assessment should include a thorough history of pain onset, aggravating/alleviating factors, neurological symptoms (radiculopathy), and functional limitations. Physical examination involves cervical AROM/PROM assessment, palpation for tenderness/muscle spasm, neurological screening (dermatomes, myotomes, reflexes), special tests (e.g., Spurling's test), and postural analysis. Imaging (X-rays, MRI) may confirm degenerative changes and assess nerve root compression. Diagnosis of cervical spondylosis is made based on clinical presentation and imaging findings.",
      "manual_therapy": "Manual therapy techniques may include: 1. Cervical joint mobilizations (grades I-IV) to address hypomobile segments, restore joint play, and modulate pain. 2. Soft tissue mobilization (massage, myofascial release, instrument-assisted soft tissue mobilization) for hypertonic paraspinal, upper trapezius, and levator scapulae muscles. 3. Sustained natural apophyseal glides (SNAGs) or MWMs (mobilizations with movement) to improve range of motion. 4. Traction (manual or mechanical) can be beneficial for reducing nerve root compression and pain.",
      "precautions": "Avoid sudden or forceful movements of the cervical spine. Monitor for any worsening neurological symptoms (increased numbness, weakness, severe radiating pain), which may indicate nerve compression or myelopathy. Exercises should be performed within a pain-free range. Avoid sustained cervical flexion, especially during early stages or if it exacerbates symptoms. Educate patients on proper body mechanics during activities of daily living and work tasks to prevent re-injury or exacerbation."
    },
    "scientific_reference": "Kisner, C., Colby, L. A., & Borstad, J. (2017). Therapeutic Exercise: Foundations and Techniques (7th ed.). F.A. Davis Company."
  },
  {
    "condition_name": "Rotator Cuff Tendinitis",
    "category": "Orthopedics",
    "clinical_presentation": {
      "definition": "Rotator cuff tendinitis is an inflammatory condition affecting one or more of the four tendons of the rotator cuff muscles (supraspinatus, infraspinatus, teres minor, and subscapularis). It commonly results from overuse, repetitive overhead activities, poor posture, or trauma, leading to pain, weakness, and restricted range of motion in the shoulder.",
      "image_description": "Patient experiencing shoulder pain, pointing to the lateral or anterior aspect of the shoulder, possibly demonstrating pain with arm elevation or reaching overhead. A professional medical illustration highlighting the inflamed rotator cuff tendons."
    },
    "electrotherapy": [
      {
        "type": "Therapeutic Ultrasound",
        "parameters": "Continuous mode, 1 MHz for deep tissues, 1.0 - 1.5 W/cm² intensity, 5-7 minutes duration.",
        "placement_guide": "Apply coupling gel generously over the superior and lateral aspect of the shoulder, directly over the palpable tender rotator cuff tendon (e.g., supraspinatus insertion), using slow, circular movements with the transducer head.",
        "goal": "To reduce local inflammation, accelerate tissue healing, decrease pain, and improve tissue extensibility by promoting increased blood flow and cellular activity.",
        "image_description": "Physical therapist applying ultrasound gel and moving an ultrasound transducer in a circular motion over the anterior-superior aspect of a patient's shoulder."
      },
      {
        "type": "Transcutaneous Electrical Nerve Stimulation (TENS)",
        "parameters": "Conventional TENS: High frequency (80-120 Hz), short pulse duration (50-100 μs), sensory level intensity (strong but comfortable tingling), 30-60 minutes.",
        "placement_guide": "Place electrodes proximal and distal to the painful area, or straddling the area of maximal pain on the shoulder (e.g., one electrode anterior, one posterior on the deltoid/supraspinatus region).",
        "goal": "To modulate pain by stimulating large diameter afferent nerve fibers, thereby overriding pain signals and promoting endogenous opioid release.",
        "image_description": "Patient with two small square electrodes placed on their shoulder, connected by wires to a portable TENS unit clipped to their clothing."
      }
    ],
    "therapeutic_exercises": {
      "phase_1": {
        "name": "Acute Pain & Inflammation Control Phase",
        "goal": "Reduce pain and inflammation, protect healing tissues, maintain passive and assisted range of motion (ROM), and initiate gentle scapular stabilization.",
        "exercises": [
          {
            "name": "Pendulum Swings",
            "instructions": "Bend forward at the waist, allowing the affected arm to hang freely. Gently swing the arm forward and backward, side to side, and in small circles, using gravity for assistance. Keep the arm relaxed and avoid using shoulder muscles.",
            "dosage": "3 sets of 20 repetitions in each direction, 2-3 times daily.",
            "image_description": "Patient bent at the waist, arm hanging down, performing small circular swings with their arm, looking relaxed."
          },
          {
            "name": "Passive/Assisted External Rotation (with stick/cane)",
            "instructions": "Lie on your back or sit upright. Hold a stick with both hands. Use your unaffected arm to gently push the stick, moving the affected arm into external rotation, keeping the elbow tucked to your side. Move only within pain-free range.",
            "dosage": "3 sets of 10-15 repetitions, holding 5 seconds at end-range, 1-2 times daily.",
            "image_description": "Patient lying supine, holding a stick horizontally with both hands, using the unaffected arm to push the affected arm into external rotation, elbow bent at 90 degrees and tucked to the side."
          },
          {
            "name": "Gentle Scapular Retractions",
            "instructions": "Sit or stand tall. Gently squeeze your shoulder blades together and down, as if trying to hold a pencil between them. Avoid shrugging your shoulders up towards your ears. Hold briefly and relax.",
            "dosage": "3 sets of 10-15 repetitions, holding for 3-5 seconds, 2 times daily.",
            "image_description": "Patient sitting or standing upright with good posture, gently squeezing shoulder blades together and down, showing subtle movement in the upper back."
          }
        ]
      },
      "phase_2": {
        "name": "Subacute Strengthening & Active ROM Phase",
        "goal": "Progress active range of motion, initiate light strengthening of the rotator cuff and scapular stabilizers, improve muscular endurance, and restore normal movement patterns.",
        "exercises": [
          {
            "name": "Isometric External/Internal Rotation",
            "instructions": "For external rotation: Stand with the affected arm's elbow bent 90 degrees and tucked to your side. Place the back of your hand against a wall. Gently push into the wall as if rotating outwards, holding for a few seconds. For internal rotation: Place the palm against a wall and push inwards. Ensure only the shoulder muscles are working, not the body.",
            "dosage": "3 sets of 10 repetitions, holding for 5-10 seconds, 1-2 times daily.",
            "image_description": "Patient standing, elbow bent 90 degrees and tucked in, pressing the back of their hand against a wall for external rotation isometric hold. Another image for internal rotation."
          },
          {
            "name": "Theraband External Rotation",
            "instructions": "Anchor a resistance band at waist height. Stand with the affected arm's elbow bent 90 degrees and tucked to your side, holding the band. Slowly pull the band outwards, rotating your forearm away from your body. Control the movement back to the start. Keep your elbow stable.",
            "dosage": "3 sets of 10-15 repetitions, 1-2 times daily.",
            "image_description": "Patient standing with a resistance band anchored to a door, performing external rotation with elbow bent 90 degrees and tucked to the side."
          },
          {
            "name": "Scaption (Shoulder Blade Elevation in Scapular Plane)",
            "instructions": "Stand with arms at your sides, thumbs pointing up. Slowly raise both arms up to shoulder height and slightly forward (about 30 degrees from the front, in the plane of the scapula), forming a 'V' shape. Control the movement back down. Avoid shrugging.",
            "dosage": "3 sets of 10-15 repetitions, 1 time daily. Use light weights (1-3 lbs) when tolerated.",
            "image_description": "Patient standing, raising arms to shoulder height at a 30-degree angle from the front, with thumbs pointing up, demonstrating the scaption movement."
          },
          {
            "name": "Wall Slides / Overhead Reach",
            "instructions": "Stand facing a wall, about a foot away. Place your forearms on the wall, elbows bent. Slowly slide your arms up the wall, raising them overhead, keeping forearms and hands in contact with the wall. Move only to a pain-free range. Control the descent.",
            "dosage": "3 sets of 10-15 repetitions, 1 time daily.",
            "image_description": "Patient standing facing a wall, forearms on the wall, sliding hands and forearms up the wall into an overhead reach position."
          }
        ]
      },
      "phase_3": {
        "name": "Advanced Strengthening & Return to Function Phase",
        "goal": "Achieve full pain-free range of motion, maximum strength, power, and endurance of the shoulder complex. Incorporate functional and sport-specific activities, and prevent recurrence.",
        "exercises": [
          {
            "name": "Overhead Press (Dumbbell)",
            "instructions": "Sit or stand with a dumbbell in each hand at shoulder height, palms facing forward. Press the dumbbells directly overhead in a controlled manner, avoiding excessive arching of the back. Slowly lower the dumbbells back to the start position.",
            "dosage": "3 sets of 8-12 repetitions, progressing weight as tolerated, 2-3 times per week.",
            "image_description": "Patient sitting or standing, performing an overhead press with dumbbells, showing good form and controlled movement."
          },
          {
            "name": "Push-ups (Wall, Incline, or Floor)",
            "instructions": "Start with wall push-ups, then progress to incline (hands on a bench/chair), and finally floor push-ups. Maintain a straight body line from head to heels. Lower your chest towards the surface by bending elbows, then push back up. Focus on scapular stability.",
            "dosage": "3 sets of 8-15 repetitions, 2-3 times per week.",
            "image_description": "Patient performing an incline push-up with hands on a stable bench, demonstrating a straight body and controlled movement."
          },
          {
            "name": "Plyometric Ball Throws (if applicable for sport)",
            "instructions": "Stand facing a wall, holding a light medicine ball. Throw the ball against the wall using an overhead motion (similar to a sport-specific throw), catching it on the rebound. Focus on power and controlled deceleration.",
            "dosage": "3 sets of 10-15 throws, 2 times per week (ensure adequate warm-up and cool-down).",
            "image_description": "Athlete throwing a medicine ball overhead against a wall, demonstrating a dynamic and powerful shoulder movement."
          },
          {
            "name": "Eccentric Rotator Cuff Strengthening",
            "instructions": "Using a resistance band or light dumbbell, perform the concentric (lifting) phase of an exercise (e.g., external rotation) with both hands, then slowly control the eccentric (lowering) phase with only the affected arm. Emphasize slow, controlled lowering over 3-5 seconds.",
            "dosage": "3 sets of 8-12 repetitions, 2 times per week.",
            "image_description": "Patient using both hands to lift a light dumbbell into an external rotation position, then slowly lowering it with only the affected arm for eccentric control."
          }
        ]
      }
    },
    "clinical_notes": {
      "assessment_diagnosis": "Diagnosis typically involves a comprehensive patient history (onset, aggravating/relieving factors, mechanism of injury), physical examination including observation for muscle atrophy/postural abnormalities, palpation for tenderness over rotator cuff tendons, active/passive range of motion assessment, and specific orthopedic special tests (e.g., Neer's impingement, Hawkins-Kennedy, Empty Can test for supraspinatus weakness, Speed's test for biceps tendinitis often co-occurring). Manual muscle testing (MMT) of rotator cuff and deltoid, and evaluation of scapular dyskinesis are crucial. Imaging such as MRI may confirm tendon inflammation or tears.",
      "manual_therapy": "Manual therapy techniques may include: \n1. Soft tissue mobilization/massage to the rotator cuff muscles, deltoid, pectoralis major/minor, latissimus dorsi, upper trapezius, and subscapularis to reduce muscle guarding and improve tissue extensibility. \n2. Myofascial release techniques to address fascial restrictions. \n3. Grade I-IV joint mobilizations for the glenohumeral joint (e.g., posterior, inferior glides to improve impingement space and ROM), acromioclavicular (AC) joint, sternoclavicular (SC) joint, and scapulothoracic articulation to restore optimal joint mechanics and reduce pain. \n4. Neuromuscular re-education to improve scapular control and proprioception.",
      "precautions": "Avoid pain-provoking movements, especially overhead activities and heavy lifting, particularly in the acute phase. Ensure proper warm-up and cool-down for all exercises. Educate the patient on proper posture and ergonomic modifications for daily activities and work. Avoid sudden, ballistic movements. Progress exercises gradually, respecting pain and tissue healing. Discontinue any exercise that causes sharp or increasing pain. Monitor for signs of worsening inflammation or progression to a full tear.",
      "scientific_reference": "Kibler, W. B., Sciascia, A. D., & Uhl, T. L. (2012). Clinical practice guidelines for shoulder rehabilitation. Journal of Athletic Training, 47(4), 433-447. (General reference for comprehensive shoulder rehab principles)"
    }
  },
  {
    "condition_name": "Patellofemoral Pain Syndrome (PFPS)",
    "category": "Orthopedic - Knee",
    "clinical_presentation": {
      "definition": "Patellofemoral Pain Syndrome (PFPS), often referred to as 'runner's knee' or 'anterior knee pain,' is characterized by diffuse pain originating from the retropatellar or peripatellar region of the knee. The pain is typically aggravated by activities that load the patellofemoral joint, such as ascending/descending stairs, running, squatting, prolonged sitting with flexed knees ('theater sign'), and jumping. It is considered a multifactorial condition involving impairments in lower extremity biomechanics, muscle strength and activation, and local patellofemoral joint mechanics.",
      "image_description": "A person, possibly an athlete or a young adult, with their hand gently touching the front of their knee, indicating pain in the patellofemoral region. The image should convey discomfort, perhaps during an activity like walking down stairs or after prolonged sitting. A focus on the knee joint area with subtle signs of inflammation or tenderness could be included."
    },
    "electrotherapy": [
      {
        "type": "TENS (Transcutaneous Electrical Nerve Stimulation)",
        "parameters": "High-frequency (50-100 Hz), short pulse duration (50-100 µs), sensory level intensity (strong but comfortable tingling), continuous mode. Duration: 20-30 minutes.",
        "placement_guide": "Place electrodes proximal and distal to the patella, or encompassing the area of maximal pain. Can be placed longitudinally over the quadriceps if diffuse pain is present.",
        "goal": "Pain modulation and symptomatic relief during the acute and subacute phases, allowing for increased tolerance to exercise.",
        "image_description": "A close-up view of a knee with two or four TENS electrodes placed around the patella, connected by wires to a TENS unit."
      },
      {
        "type": "NMES (Neuromuscular Electrical Stimulation)",
        "parameters": "Frequency: 30-50 Hz (tetanic contraction), Pulse Duration: 200-400 µs. On/Off Ratio: 1:3 to 1:5 (e.g., 10 seconds on, 30-50 seconds off). Ramp: 2 seconds. Intensity: As high as tolerated to achieve strong quadriceps contraction. Repetitions: 10-15 contractions. Duration: 15-20 minutes.",
        "placement_guide": "Place electrodes over the vastus medialis obliquus (VMO) and a common motor point of the quadriceps (e.g., rectus femoris or vastus lateralis). Ensure good contact over muscle belly.",
        "goal": "Facilitate quadriceps activation, particularly VMO, to improve patellar tracking and overall knee stability. Useful for individuals with quadriceps inhibition post-injury or surgery, or significant strength deficits.",
        "image_description": "A close-up view of the anterior thigh above the knee, showing two NMES electrodes placed over the VMO and one of the other quadriceps heads (e.g., rectus femoris), with wires attached."
      }
    ],
    "therapeutic_exercises": {
      "phase_1": {
        "name": "Pain Control & Initial Activation (Weeks 0-2)",
        "goal": "Reduce pain and inflammation, re-establish basic quadriceps and hip muscle activation, maintain range of motion, and educate on activity modification.",
        "exercises": [
          {
            "name": "Quadriceps Sets",
            "instructions": "Lie on your back with your leg extended. Press the back of your knee into the surface, tightening your thigh muscles. Hold for 5-10 seconds, focusing on feeling the muscle contract. Ensure the patella moves superiorly.",
            "dosage": "3 sets of 10-15 repetitions, 2-3 times per day.",
            "image_description": "Person lying supine with one leg extended, knee slightly pressed down, indicating quadriceps contraction. A hand might be palpating the quadriceps muscle."
          },
          {
            "name": "Straight Leg Raises (SLR) - Supine",
            "instructions": "Lie on your back with one knee bent and the foot flat on the floor. Keep the other leg straight, tighten your quadriceps, and lift the straight leg slowly about 6-12 inches off the floor. Keep the knee locked and leg straight throughout. Lower slowly. Avoid arching your back.",
            "dosage": "3 sets of 10-15 repetitions, 1-2 times per day.",
            "image_description": "Person lying supine with one leg bent, the other leg extended and lifted a few inches off the floor, demonstrating a straight leg raise."
          },
          {
            "name": "Gluteal Bridge",
            "instructions": "Lie on your back with knees bent, feet flat on the floor, hip-width apart. Engage your glutes and lift your hips off the floor until your body forms a straight line from shoulders to knees. Hold briefly, then slowly lower. Avoid arching the lower back excessively.",
            "dosage": "3 sets of 10-15 repetitions, 1-2 times per day.",
            "image_description": "Person lying supine with knees bent, hips lifted off the floor in a bridge position."
          },
          {
            "name": "Patellar Mobilizations (Self-Mobilization)",
            "instructions": "Sit with your knee relaxed and extended. Gently grasp the patella with your thumb and index finger. Gently glide the patella medially, laterally, superiorly, and inferiorly for 30 seconds in each direction. Focus on gentle, pain-free movement.",
            "dosage": "Perform 3-5 minutes, 2-3 times per day.",
            "image_description": "A hand gently moving the patella on an extended knee, demonstrating medial and lateral patellar glides."
          }
        ]
      },
      "phase_2": {
        "name": "Progressive Strengthening & Neuromuscular Re-education (Weeks 2-6)",
        "goal": "Improve quadriceps and hip strength (especially abductors and external rotators), enhance neuromuscular control, progress weight-bearing activities, and gradually increase activity tolerance.",
        "exercises": [
          {
            "name": "Mini Squats (Wall Slides)",
            "instructions": "Stand with your back against a wall, feet shoulder-width apart, about 6-12 inches from the wall. Slowly slide down the wall, bending your knees to a maximum of 30-45 degrees (pain-free range). Keep your back flat against the wall. Hold briefly, then slide back up. Focus on smooth, controlled movement.",
            "dosage": "3 sets of 10-15 repetitions, 1 time per day.",
            "image_description": "Person standing with their back against a wall, knees slightly bent in a mini-squat position, sliding down."
          },
          {
            "name": "Clamshells (Side-Lying Hip Abduction with External Rotation)",
            "instructions": "Lie on your side with knees bent at 90 degrees and hips slightly flexed. Keep your feet together. Keeping your top hip stacked directly over the bottom hip, lift your top knee towards the ceiling, rotating at the hip. Do not let your pelvis roll backward. Slowly lower. Can add a resistance band above knees.",
            "dosage": "3 sets of 15-20 repetitions per side, 1 time per day.",
            "image_description": "Person lying on their side with knees bent, lifting the top knee upwards while keeping feet together, demonstrating a clamshell exercise."
          },
          {
            "name": "Step-Ups (Low Box)",
            "instructions": "Stand in front of a low step (4-6 inches high). Place one foot entirely on the step. Push through the heel of your stepping foot to step up, bringing the other foot to meet it or just tapping it. Slowly lower the non-stepping leg back to the floor with control. Focus on maintaining knee alignment (avoiding valgus collapse).",
            "dosage": "3 sets of 10-15 repetitions per leg, 1 time per day.",
            "image_description": "Person stepping onto a low box, demonstrating proper form for a step-up, focusing on knee alignment."
          },
          {
            "name": "Single Leg Stance / Balance",
            "instructions": "Stand on one leg, maintaining good posture. Hold for 30-60 seconds. Progress by closing eyes, standing on an unstable surface (e.g., foam pad), or performing head turns.",
            "dosage": "3-5 repetitions per leg, 2-3 times per day.",
            "image_description": "Person standing on one leg with the other leg slightly lifted, demonstrating good balance and posture."
          }
        ]
      },
      "phase_3": {
        "name": "Functional Integration & Return to Activity (Weeks 6-12+)",
        "goal": "Restore full strength, power, and endurance; integrate multi-planar and sport-specific movements; optimize neuromuscular control during dynamic activities; and prepare for return to desired activities/sport while minimizing recurrence risk.",
        "exercises": [
          {
            "name": "Lunges (Forward and Lateral)",
            "instructions": "Forward Lunge: Step forward with one leg, lowering your hips until both knees are bent at approximately 90 degrees. Ensure the front knee stays behind the toes and the back knee hovers above the ground. Push back to starting position. Lateral Lunge: Step to the side, keeping the trailing leg straight and bending the leading knee, sending hips back. Focus on controlled movement and knee alignment.",
            "dosage": "3 sets of 10-12 repetitions per leg, 1 time per day.",
            "image_description": "Person performing a forward lunge, showing correct knee and body alignment."
          },
          {
            "name": "Box Jumps (Low Height)",
            "instructions": "Stand in front of a low, stable box (6-12 inches). Squat down slightly and powerfully jump onto the box, landing softly with both feet. Step down slowly. Focus on a soft, controlled landing and proper knee alignment. Progress gradually.",
            "dosage": "3 sets of 5-8 repetitions, 2-3 times per week (if appropriate for patient's goals and pain levels).",
            "image_description": "Person jumping onto a low box, captured mid-air or just at landing, demonstrating controlled movement."
          },
          {
            "name": "Agility Drills (Cone Drills)",
            "instructions": "Set up cones in various patterns (e.g., shuttle run, T-drill). Perform short, quick bursts of running, changing direction, and stopping. Focus on controlled acceleration and deceleration, maintaining knee alignment during pivots.",
            "dosage": "3-5 sets of 2-3 minutes of continuous drills, 2-3 times per week, with adequate rest between sets.",
            "image_description": "Person performing an agility drill around cones, showing dynamic movement and change of direction."
          },
          {
            "name": "Single Leg Hop & Hold",
            "instructions": "Hop forward a short distance on one leg and immediately stick the landing, holding the balanced position for 3-5 seconds. Ensure the knee tracks over the toes and hip is stable. Progress to hopping in different directions (lateral, diagonal).",
            "dosage": "3 sets of 8-10 hops per leg, 1 time per day.",
            "image_description": "Person landing from a single-leg hop, holding the balanced position with good knee and hip alignment."
          }
        ]
      }
    },
    "clinical_notes": {
      "assessment_diagnosis": "A comprehensive assessment is crucial for PFPS. This includes detailed history, palpation (patellar facets, retinacula), special tests (Clarke's sign, active patellar grind test), gait analysis, assessment of lower extremity alignment (Q-angle, foot posture), flexibility (quadriceps, hamstrings, ITB, hip flexors, gastroc/soleus), and strength testing (quadriceps, gluteal muscles - medius/maximus, hip external rotators, core). Dynamic movement analysis (e.g., single-leg squat, step-down test) is vital to identify movement impairments such as dynamic knee valgus. Differential diagnosis should rule out other knee pathologies.",
      "manual_therapy": "Manual therapy techniques may include: Patellar mobilizations (medial/lateral glides, tilts, rotations) to improve patellar mobility and reduce symptoms. Soft tissue mobilization/release for quadriceps, iliotibial band (ITB), hip flexors, and calf muscles to address tightness and reduce compensatory muscle activity. Joint mobilizations for the tibiofemoral joint or hip joint if specific hypomobilities are identified. Neural mobilization (e.g., femoral nerve glides) if neural tissue involvement is suspected. Dry needling may be considered for myofascial trigger points in the quadriceps, gluteal muscles, or hip musculature.",
      "precautions": "Always ensure exercises are performed in a pain-free range. Gradual progression of load, intensity, and duration is paramount. Avoid activities that exacerbate pain significantly. Monitor for increased swelling or persistent pain. Proper form and biomechanics must be emphasized throughout all exercises. Patient education regarding activity modification, proper footwear, and ergonomic considerations (e.g., prolonged sitting posture) is essential. Compliance with home exercise program and adherence to gradual return-to-sport guidelines are critical for successful outcomes and prevention of recurrence.",
      "scientific_reference": "Powers, C. M. (2010). The influence of altered lower-extremity kinematics on patellofemoral pain syndrome. Journal of Orthopaedic & Sports Physical Therapy, 40(2), 42-51. Retrieved from multiple peer-reviewed sources and clinical guidelines for Patellofemoral Pain Syndrome rehabilitation."
    }
  },
  {
    "condition_name": "Guillain-Barre Syndrome",
    "category": "Neurology",
    "clinical_presentation": {
      "definition": "Guillain-Barre Syndrome (GBS) is an acute, rapidly progressive, acquired inflammatory demyelinating polyneuropathy affecting the peripheral nervous system. It is characterized by an autoimmune response often triggered by an infection, leading to demyelination and axonal damage of peripheral nerves. This typically results in ascending flaccid paralysis, which can range from mild weakness to complete paralysis, often involving respiratory muscles and potentially requiring mechanical ventilation. Sensory disturbances (paresthesia, numbness) and absent or diminished deep tendon reflexes are common. The course involves a progressive phase (days to weeks), a plateau phase, and a recovery phase (weeks to years).",
      "image_description": "Stock photo of a person in a hospital bed with a physical therapist gently assisting with passive range of motion of the legs and arms, with medical equipment in the background, emphasizing muscle weakness and the early stages of recovery from a neurological condition."
    },
    "electrotherapy": [
      {
        "type": "Neuromuscular Electrical Stimulation (NMES)",
        "parameters": "Frequency: 35-50 Hz; Pulse Width: 200-300 microseconds; On/Off Ratio: 1:3 to 1:5 (e.g., 5-10 seconds on, 15-50 seconds off) to prevent fatigue; Ramp Up/Down: 1-2 seconds. Intensity: To achieve a strong, but comfortable, muscle contraction without over-fatiguing the patient.",
        "placement_guide": "Electrodes should be placed over the motor points or belly of the weakened muscles (e.g., quadriceps, tibialis anterior, gastrocnemius, deltoid, wrist extensors). Ensure good skin contact and avoid bony prominences. Monitor skin for irritation.",
        "goal": "Prevent disuse atrophy, maintain muscle viability, facilitate muscle re-education and recruitment, improve motor control, and assist in strengthening as voluntary contraction returns.",
        "image_description": "Close-up of a physical therapist applying two surface electrodes to the belly of the quadriceps muscle on a patient's thigh, connected to a portable NMES device with visible wires."
      }
    ],
    "therapeutic_exercises": {
      "phase_1": {
        "name": "Acute & Early Recovery Phase",
        "goal": "Maintain joint mobility, prevent contractures, prevent skin breakdown, maintain respiratory function, preserve muscle viability, provide gentle sensory input, and prevent complications of immobility.",
        "exercises": [
          {
            "name": "Passive Range of Motion (PROM) Exercises",
            "instructions": "The therapist or caregiver passively moves all major joints (shoulders, elbows, wrists, fingers, hips, knees, ankles, toes) through their full pain-free range. Perform slowly and rhythmically.",
            "dosage": "10-15 repetitions per joint, 2-3 times per day.",
            "image_description": "Physical therapist gently performing passive knee flexion and extension on a patient lying supine in a hospital bed."
          },
          {
            "name": "Positioning and Splinting",
            "instructions": "Regularly change patient's position (every 2 hours) to prevent pressure sores. Use pillows, wedges, and foam supports. Apply static splints (e.g., resting hand splints, ankle-foot orthoses) to prevent contractures like foot drop or wrist drop.",
            "dosage": "Continuous or intermittent splinting as needed, repositioning every 2 hours.",
            "image_description": "Patient's foot supported by a soft ankle-foot orthosis (AFO) while lying in bed, with pillows positioned to prevent external rotation."
          },
          {
            "name": "Gentle Active-Assisted Range of Motion (AAROM)",
            "instructions": "Once minimal muscle activation is detected (MRC grade 1-2), assist the patient in moving their limbs through available range. Encourage patient effort within their capabilities, avoiding over-fatigue.",
            "dosage": "5-10 repetitions per joint, 1-2 times per day, progressing as tolerated.",
            "image_description": "Physical therapist guiding a patient's arm through shoulder flexion, with the patient assisting slightly, in a supine position."
          },
          {
            "name": "Diaphragmatic Breathing Exercises",
            "instructions": "Place a hand on the abdomen and focus on breathing deeply, feeling the abdomen rise and fall. Encourage slow, controlled inhalations and exhalations to maximize lung capacity.",
            "dosage": "5-10 deep breaths, 3-5 times per day, or as tolerated.",
            "image_description": "Patient lying supine with one hand on their chest and the other on their abdomen, demonstrating diaphragmatic breathing."
          }
        ]
      },
      "phase_2": {
        "name": "Subacute & Intermediate Recovery Phase",
        "goal": "Progressively increase muscle strength and endurance, improve motor control, develop trunk stability, initiate sitting and standing balance, and prepare for functional mobility.",
        "exercises": [
          {
            "name": "Active Range of Motion (AROM) and Gravity-Eliminated Exercises",
            "instructions": "Encourage active movement of all joints against gravity when strength is MRC grade 3. For muscles with MRC grade 2, perform movements in gravity-eliminated positions (e.g., knee flexion/extension while lying on a smooth surface).",
            "dosage": "10-15 repetitions, 2-3 sets, 1-2 times per day.",
            "image_description": "Patient actively performing knee extension while sitting on the edge of a bed, demonstrating overcoming gravity."
          },
          {
            "name": "Progressive Resistive Exercises (PREs)",
            "instructions": "Once muscles reach MRC grade 3+, introduce light resistance using body weight, gravity, resistance bands, or light weights. Start with minimal resistance and gradually increase as strength improves, avoiding over-fatigue. Focus on key functional muscle groups.",
            "dosage": "8-12 repetitions, 2-3 sets, 3-4 times per week, with rest days.",
            "image_description": "Patient performing bicep curls with a light dumbbell, seated on a treatment table."
          },
          {
            "name": "Mat Exercises (Core and Trunk Stability)",
            "instructions": "Bridging, trunk rotation (supine), quadruped rocking, modified planks (on knees). Focus on engaging core muscles to improve trunk control for sitting and standing.",
            "dosage": "8-15 repetitions or 30-60 second holds, 2-3 sets, 1-2 times per day.",
            "image_description": "Patient performing a bridge exercise on a mat, lifting hips off the floor."
          },
          {
            "name": "Sitting Balance Training",
            "instructions": "Static sitting on a firm surface, then progress to dynamic sitting activities (reaching, weight shifting, perturbation training) with therapist guarding.",
            "dosage": "15-30 minutes, 1-2 times per day, with breaks as needed.",
            "image_description": "Physical therapist guarding a patient seated on the edge of a bed, encouraging them to reach for objects."
          },
          {
            "name": "Pre-Gait and Standing Balance Training",
            "instructions": "Standing in parallel bars (static standing, weight shifting), mini-squats, marching in place. Progress to single leg stance support with therapist.",
            "dosage": "10-20 minutes, 1-2 times per day, as tolerated.",
            "image_description": "Patient standing in parallel bars with a physical therapist assisting, practicing weight shifts side-to-side."
          }
        ]
      },
      "phase_3": {
        "name": "Advanced Recovery & Reintegration Phase",
        "goal": "Maximize functional independence, improve cardiovascular endurance, agility, coordination, and facilitate return to pre-morbid activities (work, leisure, sport).",
        "exercises": [
          {
            "name": "Advanced Progressive Resistive Exercises",
            "instructions": "Continue with progressive resistance training using weights, machines, and resistance bands to further increase strength and power in all major muscle groups. Incorporate compound movements.",
            "dosage": "8-15 repetitions, 2-4 sets, 3-5 times per week.",
            "image_description": "Patient performing leg presses on a gym machine, demonstrating moderate resistance."
          },
          {
            "name": "Advanced Balance and Proprioception Training",
            "instructions": "Tandem stance, single leg stance (eyes open/closed), balance board/foam, dynamic balance activities (walking heel-to-toe, obstacle courses, reaching during gait).",
            "dosage": "15-30 minutes, 1-2 times per day.",
            "image_description": "Patient standing on a BOSU ball, maintaining balance with arms outstretched."
          },
          {
            "name": "Gait and Ambulation Training",
            "instructions": "Walking on varied surfaces (uneven ground, carpet, ramps), stair climbing, community ambulation, increasing speed and distance. Incorporate dual-task activities during gait.",
            "dosage": "20-60 minutes walking, 3-5 times per week.",
            "image_description": "Patient walking independently on a paved outdoor path, looking confident."
          },
          {
            "name": "Cardiovascular Endurance Training",
            "instructions": "Stationary cycling, elliptical, swimming, treadmill walking/jogging (if appropriate). Gradually increase duration and intensity.",
            "dosage": "20-40 minutes, 3-5 times per week, at a moderate intensity (RPE 11-14).",
            "image_description": "Patient riding a stationary bicycle in a physical therapy gym."
          },
          {
            "name": "Task-Specific Functional Training",
            "instructions": "Rehearsal of specific activities of daily living (ADLs) and instrumental ADLs (IADLs) that are challenging for the patient (e.g., dressing, cooking, cleaning, lifting objects, driving simulations).",
            "dosage": "Integrate throughout the day, practicing specific tasks as needed.",
            "image_description": "Patient practicing reaching for objects on a kitchen shelf, simulating daily tasks."
          }
        ]
      }
    },
    "clinical_notes": {
      "assessment_diagnosis": "Diagnosis of GBS is typically made clinically based on rapidly progressive weakness, absent/diminished reflexes, and often supported by electrodiagnostic studies (nerve conduction studies showing demyelination or axonal damage) and CSF analysis (elevated protein with normal cell count). Physical therapy assessment focuses on detailed neurological examination (muscle strength using MRC scale, sensation, reflexes), functional status (FIM, Barthel Index), balance, gait, range of motion, respiratory function, pain assessment, and assessment for potential complications (e.g., foot drop, pressure sores). Baseline measurements are crucial for tracking recovery.",
      "manual_therapy": "Manual therapy techniques may be used cautiously. Gentle passive range of motion and joint mobilizations can help maintain joint integrity and prevent stiffness, particularly in joints prone to contractures (ankles, wrists). Soft tissue mobilization may be used for pain relief, muscle spasm, or to address secondary musculoskeletal issues arising from altered movement patterns. Neural mobilizations might be considered in later stages as tolerated, but careful monitoring for exacerbation of symptoms is essential.",
      "precautions": "Vigilant monitoring for over-fatigue is paramount, as patients with GBS are highly susceptible to post-exertional fatigue, which can delay recovery. Activity must be carefully graded and symptom-limited. Monitor respiratory status closely, especially in acute phases. Protect skin integrity to prevent pressure sores. Watch for signs of autonomic dysfunction (orthostatic hypotension, cardiac arrhythmias, blood pressure fluctuations). Pain management is crucial. Avoid overstretching denervated muscles. Educate patients and caregivers on energy conservation techniques and pacing activities."
    },
    "scientific_reference": "O'Sullivan, S. B., Schmitz, T. J., & Fulk, G. D. (2019). Physical Rehabilitation. F.A. Davis Company."
  },
  {
    "condition_name": "Rheumatoid Arthritis - Orthopedics",
    "category": "Autoimmune/Inflammatory Joint Disease",
    "clinical_presentation": {
      "definition": "Rheumatoid Arthritis (RA) is a chronic, systemic autoimmune disease characterized by symmetric polyarthritis, primarily affecting the small joints of the hands and feet, but can also involve larger joints like knees, shoulders, and hips. It leads to inflammation of the synovial membrane, causing pain, swelling, stiffness, and progressive joint destruction, cartilage erosion, and bone deformity. Systemic symptoms like fatigue, malaise, and fever are common.",
      "image_description": "Close-up of a person's hands showing typical signs of Rheumatoid Arthritis, including swollen, red, and deformed metacarpophalangeal (MCP) and proximal interphalangeal (PIP) joints, ulnar deviation of fingers, and Boutonnière or Swan-neck deformities. The skin might appear thin or atrophic."
    },
    "electrotherapy": [
      {
        "type": "Transcutaneous Electrical Nerve Stimulation (TENS)",
        "parameters": "Conventional TENS: Frequency 80-120 Hz, Pulse Duration 50-100 µs, Intensity to comfortable sensation (strong but not painful), duration 30-60 minutes, 1-3 times daily as needed for pain.",
        "placement_guide": "Place electrodes on either side of the painful joint or over nerve pathways supplying the painful area. Ensure good skin contact.",
        "goal": "To provide symptomatic pain relief by stimulating sensory nerves and activating endogenous opioid mechanisms (gate control theory and opioid release).",
        "image_description": "Illustration showing TENS electrodes placed on the dorsal aspect of a swollen wrist joint, with wires connecting to a small portable TENS unit."
      },
      {
        "type": "Pulsed Ultrasound",
        "parameters": "Frequency 1 or 3 MHz (depending on joint depth), Pulsed mode (e.g., 1:3 or 1:4 duty cycle), Intensity 0.5-1.0 W/cm², Duration 5-10 minutes per joint, 3-5 times per week during periods of active inflammation.",
        "placement_guide": "Apply coupling gel generously over the affected joint and surrounding soft tissues. Move the ultrasound head in slow, overlapping circles or longitudinal strokes over the area.",
        "goal": "To reduce inflammation, promote soft tissue healing, and alleviate pain in acutely or subacutely inflamed joints through non-thermal mechanical effects.",
        "image_description": "Image of a physical therapist applying an ultrasound transducer with gel over a patient's knee joint, with the ultrasound machine visible in the background."
      }
    ],
    "therapeutic_exercises": {
      "phase_1": {
        "name": "Acute / Inflammatory Phase - Joint Protection & Pain Management",
        "goal": "To reduce pain and inflammation, preserve joint integrity, maintain existing range of motion, and educate on joint protection principles.",
        "exercises": [
          {
            "name": "Gentle Active Assisted Range of Motion (AAROM) / Passive Range of Motion (PROM)",
            "instructions": "Gently move each affected joint through its available range of motion without pain. Use your other hand or a stick/towel to assist. Avoid end-range stretching. Perform slow, controlled movements.",
            "dosage": "5-10 repetitions per joint, 2-3 times per day.",
            "image_description": "A patient gently moving their fingers and wrist through range of motion, possibly with the aid of their other hand to support the movement. Emphasize a relaxed, non-strained expression."
          },
          {
            "name": "Isometric Muscle Contractions",
            "instructions": "Gently contract muscles around affected joints without causing joint movement. Hold the contraction for a few seconds. For example, gently push palms together for hand muscles, or perform quadriceps sets by tightening thigh muscles.",
            "dosage": "Hold for 3-5 seconds, 5-8 repetitions, 1-2 times per day.",
            "image_description": "A person sitting with a rolled towel under their knee, gently pressing the knee down to activate the quadriceps muscles without moving the joint, or pressing palms together."
          },
          {
            "name": "Tendon Gliding Exercises (for Hands)",
            "instructions": "Perform a series of hand positions: 1) Straight hand, 2) Hook fist (MCPs flexed, IPs straight), 3) Full fist (all joints flexed), 4) Tabletop (MCPs straight, IPs flexed), 5) Straight fist (MCPs flexed, PIPs flexed, DIPs straight). Move slowly and gently.",
            "dosage": "5-10 repetitions of the sequence, 2-3 times per day.",
            "image_description": "A sequence of five hand positions demonstrating tendon gliding exercises, from a fully open hand to a full fist."
          }
        ]
      },
      "phase_2": {
        "name": "Sub-acute / Rehabilitation Phase - Strength & Functional Mobility",
        "goal": "To improve muscle strength, endurance, joint stability, flexibility, and functional capacity while continuing joint protection.",
        "exercises": [
          {
            "name": "Light Resistance Band Exercises",
            "instructions": "Using a light resistance band, perform exercises like shoulder flexion/abduction, elbow flexion/extension, knee flexion/extension. Ensure movements are controlled and do not cause pain. Start with low resistance.",
            "dosage": "8-12 repetitions, 2-3 sets, 3-4 times per week.",
            "image_description": "A person performing a bicep curl with a light resistance band, demonstrating good form and controlled movement, possibly seated."
          },
          {
            "name": "Therapeutic Cycling / Aquatic Exercises",
            "instructions": "Engage in low-impact aerobic activities. Cycling on a stationary bike or walking/exercising in a warm pool reduces joint load while improving cardiovascular endurance and muscle strength. Focus on comfortable pace and duration.",
            "dosage": "20-30 minutes, 3-5 times per week.",
            "image_description": "A person cycling gently on a stationary recumbent bike in a rehabilitation gym, or a person performing gentle leg movements in a warm therapy pool."
          },
          {
            "name": "Balance and Proprioception Training",
            "instructions": "Perform exercises like single-leg stance (holding onto support initially), tandem stance, or heel-to-toe walking. Gradually progress by reducing support or closing eyes if safe and appropriate.",
            "dosage": "Hold for 15-30 seconds, 3-5 repetitions per leg, 2-3 times per day.",
            "image_description": "A person standing on one leg next to a stable support (e.g., a chair or parallel bars), maintaining balance."
          }
        ]
      },
      "phase_3": {
        "name": "Maintenance / Advanced Function Phase - Long-term Management & Prevention",
        "goal": "To maximize functional independence, promote long-term joint health, prevent progression of deformity, and ensure self-management of symptoms.",
        "exercises": [
          {
            "name": "Progressive Resistance Training",
            "instructions": "Advance to moderate resistance with weights or resistance bands for major muscle groups. Focus on controlled movements, proper form, and listen to your body to avoid over-exertion or joint stress. Include functional movements like squats, lunges, and step-ups.",
            "dosage": "8-15 repetitions, 2-3 sets, 2-3 times per week, with rest days in between.",
            "image_description": "A person performing a bodyweight squat or a lunge with light dumbbells, demonstrating good knee and hip alignment."
          },
          {
            "name": "Functional Task-Specific Training",
            "instructions": "Practice activities of daily living (ADLs) and instrumental ADLs (IADLs) with an emphasis on joint protection techniques and energy conservation. Examples include practicing lifting techniques, modified gripping for tasks, and organizing environment.",
            "dosage": "Integrate into daily routines with conscious application of techniques.",
            "image_description": "A person demonstrating an ergonomic way to lift an object from the floor, bending at the knees and hips, keeping the back straight, or using adaptive equipment for dressing."
          },
          {
            "name": "Low-Impact Aerobic and Recreational Activities",
            "instructions": "Continue regular low-impact activities like swimming, walking, cycling, or Tai Chi. Encourage participation in modified recreational activities that respect joint limitations and promote overall well-being.",
            "dosage": "30-60 minutes, 3-5 times per week.",
            "image_description": "A person practicing Tai Chi outdoors in a park, or enjoying a brisk walk on a level path."
          }
        ]
      }
    },
    "clinical_notes": {
      "assessment_diagnosis": "Assessment should focus on a thorough joint examination (swelling, tenderness, deformity, limited ROM, crepitus), assessment of functional limitations using validated outcome measures (e.g., HAQ-DI, DAS28), evaluation of pain and fatigue levels, and review of medical history and laboratory findings (e.g., RF, anti-CCP, ESR, CRP). Diagnosis is typically made by a rheumatologist based on clinical criteria and lab tests.",
      "manual_therapy": "Manual therapy must be performed with extreme caution. Gentle, non-painful joint mobilizations (Grade I-II oscillations) may be used to reduce pain and maintain joint play, particularly in stable joints not experiencing active inflammation. Soft tissue mobilization for muscle spasm or guarding around joints can be beneficial. Aggressive mobilization, manipulation, or stretching during acute flares is contraindicated due to increased joint laxity, inflammation, and potential for tissue damage.",
      "precautions": "Respect pain during all activities. Avoid over-stressing inflamed joints. Educate patients on joint protection strategies (e.g., using larger joints, distributing force, avoiding prolonged static positions, using assistive devices). Monitor for signs of systemic inflammation (fever, increased fatigue). Be aware of medication side effects (e.g., corticosteroid-induced osteoporosis, skin fragility). Emphasize energy conservation and pacing activities to manage fatigue."
    },
    "scientific_reference": "Smolen JS, Landewé RBM, Bijlsma JWRJ, et al. EULAR recommendations for the management of rheumatoid arthritis with synthetic and biological disease-modifying antirheumatic drugs: 2022 update. Ann Rheum Dis. 2023;82(1):3-18. American College of Rheumatology (ACR) Guidelines for the Management of Rheumatoid Arthritis."
  }
]